docs/api.org
* About
Documentation for the Backend API and architecture of the Client.


