docs/api.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-03-01 Fri 01:26 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgf7f4057">1. About</a></li>
<li><a href="#orgc1d06fa">2. Device Tasks</a>
<ul>
<li><a href="#orgc676f9d">2.1. List Devices</a>
<ul>
<li><a href="#orgea5097c">2.1.1. Client request</a></li>
<li><a href="#org46a4076">2.1.2. Backend request</a></li>
<li><a href="#org14d3eda">2.1.3. Backend response</a></li>
<li><a href="#org1e92ede">2.1.4. Client response</a></li>
</ul>
</li>
<li><a href="#orgc16ba40">2.2. List Scoreboard Devices</a>
<ul>
<li><a href="#org7810110">2.2.1. Client request</a></li>
<li><a href="#orgbef4801">2.2.2. Backend request</a></li>
<li><a href="#org0645f69">2.2.3. Backend response</a></li>
<li><a href="#org6c5d1da">2.2.4. Client response</a></li>
</ul>
</li>
<li><a href="#orga64f645">2.3. List Scoreboard Device Views</a>
<ul>
<li><a href="#org669faaf">2.3.1. Client request</a></li>
<li><a href="#org536f4fb">2.3.2. Backend request</a></li>
<li><a href="#org494e478">2.3.3. Backend response</a></li>
<li><a href="#orgd2f5f43">2.3.4. Client response</a></li>
</ul>
</li>
<li><a href="#org0632711">2.4. Update Scoreboard Device View</a>
<ul>
<li><a href="#org30562de">2.4.1. Client request</a></li>
<li><a href="#org37862f5">2.4.2. Backend request</a></li>
<li><a href="#org10cda86">2.4.3. Backend response</a></li>
<li><a href="#org992df7d">2.4.4. Client response</a></li>
</ul>
</li>
<li><a href="#org11cd796">2.5. Boot Device</a>
<ul>
<li><a href="#org1d7a9e2">2.5.1. Client request</a></li>
<li><a href="#org1694b86">2.5.2. Backend request</a></li>
<li><a href="#org972be22">2.5.3. Backend response</a></li>
<li><a href="#org419cadf">2.5.4. Client response</a></li>
</ul>
</li>
<li><a href="#org32d9945">2.6. Shutdown Device</a>
<ul>
<li><a href="#orgdb71b66">2.6.1. Client request</a></li>
<li><a href="#org54472b4">2.6.2. Backend request</a></li>
<li><a href="#orge65038e">2.6.3. Backend response</a></li>
<li><a href="#orgf145106">2.6.4. Client response</a></li>
</ul>
</li>
<li><a href="#org4b08c6e">2.7. Restart Device</a>
<ul>
<li><a href="#org33110d8">2.7.1. Client request</a></li>
<li><a href="#orge1e9c65">2.7.2. Backend request</a></li>
<li><a href="#org76cc8e5">2.7.3. Backend response</a></li>
<li><a href="#orga528075">2.7.4. Client response</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org04b9cf8">3. Scoreboard Tasks</a>
<ul>
<li><a href="#org7425a0f">3.1. List Scoreboard</a>
<ul>
<li><a href="#orgaaf39c9">3.1.1. Client request</a></li>
<li><a href="#orge2d053b">3.1.2. Backend request</a></li>
<li><a href="#org9d7afe4">3.1.3. Backend response</a></li>
<li><a href="#org8cdd62f">3.1.4. Client response</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6558f3c">4. Player Tasks</a>
<ul>
<li><a href="#org9e5b8d2">4.1. List Registered Players</a>
<ul>
<li><a href="#org1487eca">4.1.1. Client request</a></li>
<li><a href="#org452aa0d">4.1.2. Backend request</a></li>
<li><a href="#orgd1cbd78">4.1.3. Backend response</a></li>
<li><a href="#orge70c4fd">4.1.4. Client response</a></li>
</ul>
</li>
<li><a href="#org7663d77">4.2. List Players with a Wristband</a>
<ul>
<li><a href="#orgb758f4f">4.2.1. Client request</a></li>
<li><a href="#org77faf66">4.2.2. Backend request</a></li>
<li><a href="#orgfd338a9">4.2.3. Backend response</a></li>
<li><a href="#org2269e25">4.2.4. Client response</a></li>
</ul>
</li>
<li><a href="#orgc8bd2b8">4.3. Search Player</a>
<ul>
<li><a href="#org1f17f42">4.3.1. Client request</a></li>
<li><a href="#org174bc0a">4.3.2. Backend request</a></li>
<li><a href="#org318b105">4.3.3. Backend response</a></li>
<li><a href="#org8abb9bb">4.3.4. Client response</a></li>
</ul>
</li>
<li><a href="#orgea06395">4.4. Register Player</a>
<ul>
<li><a href="#org85d9df8">4.4.1. Client request</a></li>
<li><a href="#org0902fdb">4.4.2. Backend request</a></li>
<li><a href="#orgc9160c5">4.4.3. Backend response</a></li>
<li><a href="#orgd79b7e0">4.4.4. Client response</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgfcaf99e">5. Wristband Tasks</a>
<ul>
<li><a href="#org1618f55">5.1. Register Wristband</a>
<ul>
<li><a href="#org41b3623">5.1.1. Client request</a></li>
<li><a href="#org7e5be67">5.1.2. Backend request</a></li>
<li><a href="#org50dd7b8">5.1.3. Backend response</a></li>
<li><a href="#org92bc080">5.1.4. Client response</a></li>
</ul>
</li>
<li><a href="#org3b74967">5.2. Deregister Wristband</a>
<ul>
<li><a href="#orgd90bdbb">5.2.1. Client request</a></li>
<li><a href="#org1d3e116">5.2.2. Backend request</a></li>
<li><a href="#orgba2bbce">5.2.3. Backend response</a></li>
<li><a href="#org0c886dd">5.2.4. Client response</a></li>
</ul>
</li>
<li><a href="#org0b4cba4">5.3. Get Wristband Information</a>
<ul>
<li><a href="#orgb53fea7">5.3.1. Client request</a></li>
<li><a href="#org264332b">5.3.2. Backend request</a></li>
<li><a href="#org6d53f91">5.3.3. Backend response</a></li>
<li><a href="#orgc6f21e9">5.3.4. Client response</a></li>
</ul>
</li>
<li><a href="#org4fe1edf">5.4. Scan Wristband</a>
<ul>
<li><a href="#org5b8388b">5.4.1. Client request</a></li>
<li><a href="#orgf3471fe">5.4.2. Backend request</a></li>
<li><a href="#org12b4eb9">5.4.3. Backend response</a></li>
<li><a href="#orga4a2d5b">5.4.4. Client request</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orge235f88">6. Cashier Tasks</a>
<ul>
<li><a href="#org6ee483f">6.1. List Cashiers</a>
<ul>
<li><a href="#org046538b">6.1.1. Client request</a></li>
<li><a href="#org1af8034">6.1.2. Backend request</a></li>
<li><a href="#orgf41dc21">6.1.3. Backend response</a></li>
<li><a href="#org8a90f05">6.1.4. Client response</a></li>
</ul>
</li>
<li><a href="#orgca73a8c">6.2. Login Cashier</a>
<ul>
<li><a href="#org5bc4e09">6.2.1. Client request</a></li>
<li><a href="#orgd96253a">6.2.2. Backend request</a></li>
<li><a href="#orgd4de203">6.2.3. Backend response</a></li>
<li><a href="#org161f4cb">6.2.4. Client response</a></li>
</ul>
</li>
<li><a href="#org4326e9a">6.3. Register Cashier</a>
<ul>
<li><a href="#org4c404bb">6.3.1. Client request</a></li>
<li><a href="#org11200dd">6.3.2. Backend request</a></li>
<li><a href="#org517b4f4">6.3.3. Backend response</a></li>
<li><a href="#org671d13b">6.3.4. Client response</a></li>
</ul>
</li>
<li><a href="#org69c389e">6.4. Deregister Cashier</a>
<ul>
<li><a href="#org3d5207a">6.4.1. Client request</a></li>
<li><a href="#org09d1bc5">6.4.2. Backend request</a></li>
<li><a href="#org8cf89c0">6.4.3. Backend response</a></li>
<li><a href="#orgce1e050">6.4.4. Client response</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org51f5d2e">7. Package Tasks</a>
<ul>
<li><a href="#orge669d80">7.1. List Packages</a>
<ul>
<li><a href="#orgd9c59eb">7.1.1. Client request</a></li>
<li><a href="#org53b8b72">7.1.2. Backend request</a></li>
<li><a href="#org721c9ad">7.1.3. Backend response</a></li>
<li><a href="#org36ad254">7.1.4. Client response</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org036a671">8. Team Tasks</a>
<ul>
<li><a href="#orge8f8080">8.1. Register Team</a>
<ul>
<li><a href="#orge868166">8.1.1. Client request</a></li>
<li><a href="#org4b423ca">8.1.2. Backend request</a></li>
<li><a href="#orgddf9b3a">8.1.3. Backend response</a></li>
<li><a href="#org9d58f1a">8.1.4. Client response</a></li>
</ul>
</li>
<li><a href="#org3d14772">8.2. Register Team Package</a>
<ul>
<li><a href="#org6f5e81d">8.2.1. Client request</a></li>
<li><a href="#org89c699c">8.2.2. Backend request</a></li>
<li><a href="#org3683c9c">8.2.3. Backend response</a></li>
<li><a href="#orgc922d12">8.2.4. Client response</a></li>
</ul>
</li>
<li><a href="#orgd1bce40">8.3. Deregister Team Package</a>
<ul>
<li><a href="#orgf9786b6">8.3.1. Client request</a></li>
<li><a href="#orge61d963">8.3.2. Backend request</a></li>
<li><a href="#orgb5aedba">8.3.3. Backend response</a></li>
<li><a href="#orgf3984a4">8.3.4. Client response</a></li>
</ul>
</li>
<li><a href="#org3119b1b">8.4. Start team</a>
<ul>
<li><a href="#org81b1520">8.4.1. Client request</a></li>
<li><a href="#orgb5c4b2d">8.4.2. Backend request</a></li>
<li><a href="#org51bb6d1">8.4.3. Backend response</a></li>
<li><a href="#org135c228">8.4.4. Client response</a></li>
</ul>
</li>
<li><a href="#org82104d6">8.5. Find Team</a>
<ul>
<li><a href="#org35cfe4a">8.5.1. Client request</a></li>
<li><a href="#orgb83d524">8.5.2. Client response</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org34e942b">9. Session Tasks</a>
<ul>
<li><a href="#orgff91850">9.1. List Session</a>
<ul>
<li><a href="#orgae9a498">9.1.1. Backend response</a></li>
<li><a href="#orgbc3db77">9.1.2. Client response</a></li>
</ul>
</li>
<li><a href="#org9745dbf">9.2. Start Session</a>
<ul>
<li><a href="#org9bf0e9e">9.2.1. Client request</a></li>
<li><a href="#org1bac223">9.2.2. Backend request</a></li>
<li><a href="#orga6274e7">9.2.3. Backend response</a></li>
<li><a href="#orgb42d96f">9.2.4. Client request</a></li>
</ul>
</li>
<li><a href="#orge0cafbe">9.3. Stop Session</a>
<ul>
<li><a href="#orgf75417f">9.3.1. Client request</a></li>
<li><a href="#orgd1a85c6">9.3.2. Backend request</a></li>
<li><a href="#org89f98b3">9.3.3. Backend response</a></li>
<li><a href="#org02dc536">9.3.4. Client response</a></li>
</ul>
</li>
<li><a href="#org7be7d03">9.4. Stop Sesson force</a></li>
</ul>
</li>
<li><a href="#orgec173e7">10. The Command pattern</a></li>
<li><a href="#orga2d8376">11. Conventions</a>
<ul>
<li><a href="#org546a091">11.1. Command inputs and outputs</a></li>
<li><a href="#org90f361c">11.2. Commands wrap their return value within an object</a></li>
</ul>
</li>
<li><a href="#org3b73337">12. Normalization functions</a>
<ul>
<li><a href="#orgfb36496">12.1. Inputs</a></li>
<li><a href="#orga2a7e22">12.2. Deducing state</a></li>
</ul>
</li>
<li><a href="#orgc8831e6">13. Schemas</a>
<ul>
<li><a href="#org3f6d35d">13.1. Package</a>
<ul>
<li><a href="#orgaefa1a9">13.1.1. AFM Time</a></li>
<li><a href="#orgb41b58b">13.1.2. AFM Missions</a></li>
<li><a href="#org76eed2b">13.1.3. Backend Time</a></li>
<li><a href="#org865619b">13.1.4. Backend Missions</a></li>
<li><a href="#org2dca677">13.1.5. Available Backend packages</a></li>
</ul>
</li>
<li><a href="#orgd96f68f">13.2. Device</a>
<ul>
<li><a href="#orgc387d02">13.2.1. AFM rpi reader</a></li>
<li><a href="#org33e7c99">13.2.2. AFM admin screen</a></li>
<li><a href="#orgd3722b7">13.2.3. Backend</a></li>
</ul>
</li>
<li><a href="#org4037363">13.3. Cashier</a>
<ul>
<li><a href="#org96a6d58">13.3.1. AFM</a></li>
</ul>
</li>
<li><a href="#orge0a8a15">13.4. Player</a>
<ul>
<li><a href="#orgeb3be3f">13.4.1. AFM</a></li>
<li><a href="#orgf900f7c">13.4.2. Backend</a></li>
</ul>
</li>
<li><a href="#org8affc75">13.5. Team</a></li>
<li><a href="#org265e2ce">13.6. Wristband</a>
<ul>
<li><a href="#org3e9c380">13.6.1. AFM</a></li>
<li><a href="#org50bfd99">13.6.2. Backend</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="outline-container-orgf7f4057" class="outline-2">
<h2 id="orgf7f4057"><span class="section-number-2">1.</span> About</h2>
<div class="outline-text-2" id="text-1">
<p>
Documentation for the Backend API and architecture of the Client.
</p>
</div>
</div>
