docs/api.org
* Device Tasks
** List Devices
*** Client request
#+begin_src js
  // 1st argument, optional, options
  {
    queue: true || false
  }
#+end_src
*** Backend request
#+begin_src js
  {
    timestamp: 1706709130813,
  }
#+end_src
*** Backend response
#+begin_src js
  {
  timestamp: 1706709130813,
  result: 'OK',
  devices: [
    {
      deviceType: 'SCOREBOARD_SCREEN',
      roomType: 'SCOREBOARD1',
      deviceId: 'scor1',
      macAddress: null,
      ipAddress: null,
      bootedTimestamp: 1702243701606
    },
    {
      deviceType: 'SCOREBOARD_SCREEN',
      roomType: 'SCOREBOARD2',
      deviceId: 'scor2',
      macAddress: null,
      ipAddress: null,
      bootedTimestamp: 1702243701625
    },
    {
      deviceType: 'REGISTRATION_SCREEN',
      roomType: 'ADMINISTRATION1',
      deviceId: '001',
      macAddress: null,
      ipAddress: null,
      bootedTimestamp: 1706707719741
    },
    {
      deviceType: 'RPI_READER',
      roomType: 'ADMINISTRATION1',
      deviceId: 'ADMINISTRATION1Reader',
      macAddress: null,
      ipAddress: null,
      bootedTimestamp: 1705889333198
    }
  ]
}
#+end_src
*** Client response
#+begin_src js
  {
    ok: true,
    devices: [
      {
        id: 'scor1',
        type: 'SCOREBOARD_SCREEN',
        room: 'SCOREBOARD1',
        view: null
      },
      {
        id: 'scor2',
        type: 'SCOREBOARD_SCREEN',
        room: 'SCOREBOARD2',
        view: null
      },
      {
        id: '001',
        type: 'REGISTRATION_SCREEN',
        room: 'ADMINISTRATION1',
        view: null
      },
      {
        id: 'ADMINISTRATION1Reader',
        type: 'RPI_READER',
        room: 'ADMINISTRATION1',
        view: null
      }
    ]
  }
#+end_src

** List Scoreboard Devices
*** Client request
#+begin_src js
  // 1st argument, optional, options
  {
    queue: true | false
  }
#+end_src
*** Backend request
#+begin_src js
  {
    timestamp: 1706711522546,
  }
#+end_src
*** Backend response
#+begin_src js
  {
    timestamp: 1706711522546,
    result: 'OK',
    scoreboardDevices: [
      {
        deviceId: 'scor1',
        deviceType: 'SCOREBOARD_SCREEN',
        roomType: 'SCOREBOARD1',
        status: 'ROTATING'
      },
      {
        deviceId: 'scor2',
        deviceType: 'SCOREBOARD_SCREEN',
        roomType: 'SCOREBOARD2',
        status: 'MONTHLY'
      }
    ]
  }
#+end_src
*** Client response
#+begin_src js
  {
    ok: true,
    scoreboardDevices: [
      {
        id: 'scor1',
        type: 'SCOREBOARD_SCREEN',
        room: 'SCOREBOARD1',
        view: 'ROTATING'
      },
      {
        id: 'scor2',
        type: 'SCOREBOARD_SCREEN',
        room: 'SCOREBOARD2',
        view: 'MONTHLY'
      }
    ]
  }
#+end_src

** List Scoreboard Device Views
*** Client request
#+begin_src js
  // 1st argument, optional, options
  {
    queue: true | false
  }
#+end_src
*** Backend request
#+begin_src js
  {
    timestamp: 1706712075044,
  }
#+end_src
