docs/api.html


<div id="outline-container-orgc1d06fa" class="outline-2">
<h2 id="orgc1d06fa"><span class="section-number-2">2.</span> Device Tasks</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-orgc676f9d" class="outline-3">
<h3 id="orgc676f9d"><span class="section-number-3">2.1.</span> List Devices</h3>
<div class="outline-text-3" id="text-2-1">
</div>
<div id="outline-container-orgea5097c" class="outline-4">
<h4 id="orgea5097c"><span class="section-number-4">2.1.1.</span> Client request</h4>
<div class="outline-text-4" id="text-2-1-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, optional, options</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> || <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org46a4076" class="outline-4">
<h4 id="org46a4076"><span class="section-number-4">2.1.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706709130813</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org14d3eda" class="outline-4">
<h4 id="org14d3eda"><span class="section-number-4">2.1.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-2-1-3">
<div class="org-src-container">
<pre class="src src-js">  <span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706709130813</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  devices: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      deviceType: <span style="color: #2d9574;">'SCOREBOARD_SCREEN'</span>,
      roomType: <span style="color: #2d9574;">'SCOREBOARD1'</span>,
      deviceId: <span style="color: #2d9574;">'scor1'</span>,
      macAddress: <span style="color: #a45bad;">null</span>,
      ipAddress: <span style="color: #a45bad;">null</span>,
      bootedTimestamp: <span style="color: #a45bad;">1702243701606</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      deviceType: <span style="color: #2d9574;">'SCOREBOARD_SCREEN'</span>,
      roomType: <span style="color: #2d9574;">'SCOREBOARD2'</span>,
      deviceId: <span style="color: #2d9574;">'scor2'</span>,
      macAddress: <span style="color: #a45bad;">null</span>,
      ipAddress: <span style="color: #a45bad;">null</span>,
      bootedTimestamp: <span style="color: #a45bad;">1702243701625</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      deviceType: <span style="color: #2d9574;">'REGISTRATION_SCREEN'</span>,
      roomType: <span style="color: #2d9574;">'ADMINISTRATION1'</span>,
      deviceId: <span style="color: #2d9574;">'001'</span>,
      macAddress: <span style="color: #a45bad;">null</span>,
      ipAddress: <span style="color: #a45bad;">null</span>,
      bootedTimestamp: <span style="color: #a45bad;">1706707719741</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      deviceType: <span style="color: #2d9574;">'RPI_READER'</span>,
      roomType: <span style="color: #2d9574;">'ADMINISTRATION1'</span>,
      deviceId: <span style="color: #2d9574;">'ADMINISTRATION1Reader'</span>,
      macAddress: <span style="color: #a45bad;">null</span>,
      ipAddress: <span style="color: #a45bad;">null</span>,
      bootedTimestamp: <span style="color: #a45bad;">1705889333198</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1e92ede" class="outline-4">
<h4 id="org1e92ede"><span class="section-number-4">2.1.4.</span> Client response</h4>
<div class="outline-text-4" id="text-2-1-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  devices: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      id: <span style="color: #2d9574;">'scor1'</span>,
      type: <span style="color: #2d9574;">'SCOREBOARD_SCREEN'</span>,
      room: <span style="color: #2d9574;">'SCOREBOARD1'</span>,
      view: <span style="color: #a45bad;">null</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      id: <span style="color: #2d9574;">'scor2'</span>,
      type: <span style="color: #2d9574;">'SCOREBOARD_SCREEN'</span>,
      room: <span style="color: #2d9574;">'SCOREBOARD2'</span>,
      view: <span style="color: #a45bad;">null</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      id: <span style="color: #2d9574;">'001'</span>,
      type: <span style="color: #2d9574;">'REGISTRATION_SCREEN'</span>,
      room: <span style="color: #2d9574;">'ADMINISTRATION1'</span>,
      view: <span style="color: #a45bad;">null</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      id: <span style="color: #2d9574;">'ADMINISTRATION1Reader'</span>,
      type: <span style="color: #2d9574;">'RPI_READER'</span>,
      room: <span style="color: #2d9574;">'ADMINISTRATION1'</span>,
      view: <span style="color: #a45bad;">null</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc16ba40" class="outline-3">
<h3 id="orgc16ba40"><span class="section-number-3">2.2.</span> List Scoreboard Devices</h3>
<div class="outline-text-3" id="text-2-2">
</div>
<div id="outline-container-org7810110" class="outline-4">
<h4 id="org7810110"><span class="section-number-4">2.2.1.</span> Client request</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, optional, options</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> | <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgbef4801" class="outline-4">
<h4 id="orgbef4801"><span class="section-number-4">2.2.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706711522546</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org0645f69" class="outline-4">
<h4 id="org0645f69"><span class="section-number-4">2.2.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-2-2-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706711522546</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  scoreboardDevices: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      deviceId: <span style="color: #2d9574;">'scor1'</span>,
      deviceType: <span style="color: #2d9574;">'SCOREBOARD_SCREEN'</span>,
      roomType: <span style="color: #2d9574;">'SCOREBOARD1'</span>,
      status: <span style="color: #2d9574;">'ROTATING'</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      deviceId: <span style="color: #2d9574;">'scor2'</span>,
      deviceType: <span style="color: #2d9574;">'SCOREBOARD_SCREEN'</span>,
      roomType: <span style="color: #2d9574;">'SCOREBOARD2'</span>,
      status: <span style="color: #2d9574;">'MONTHLY'</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org6c5d1da" class="outline-4">
<h4 id="org6c5d1da"><span class="section-number-4">2.2.4.</span> Client response</h4>
<div class="outline-text-4" id="text-2-2-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  scoreboardDevices: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      id: <span style="color: #2d9574;">'scor1'</span>,
      type: <span style="color: #2d9574;">'SCOREBOARD_SCREEN'</span>,
      room: <span style="color: #2d9574;">'SCOREBOARD1'</span>,
      view: <span style="color: #2d9574;">'ROTATING'</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      id: <span style="color: #2d9574;">'scor2'</span>,
      type: <span style="color: #2d9574;">'SCOREBOARD_SCREEN'</span>,
      room: <span style="color: #2d9574;">'SCOREBOARD2'</span>,
      view: <span style="color: #2d9574;">'MONTHLY'</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orga64f645" class="outline-3">
<h3 id="orga64f645"><span class="section-number-3">2.3.</span> List Scoreboard Device Views</h3>
<div class="outline-text-3" id="text-2-3">
</div>
