docs/api.md


<a id="orgc15b6b2"></a>

# Device Tasks


<a id="orgb776718"></a>

## List Devices


<a id="org6d4c5f7"></a>

### Client request

    // 1st argument, optional, options
    {
      queue: true || false
    }


<a id="orga8f29a6"></a>

### Backend request

    {
      timestamp: 1706709130813,
    }


<a id="org9eecdcb"></a>

### Backend response

      {
      timestamp: 1706709130813,
      result: 'OK',
      devices: [
        {
          deviceType: 'SCOREBOARD_SCREEN',
          roomType: 'SCOREBOARD1',
          deviceId: 'scor1',
          macAddress: null,
          ipAddress: null,
          bootedTimestamp: 1702243701606
        },
        {
          deviceType: 'SCOREBOARD_SCREEN',
          roomType: 'SCOREBOARD2',
          deviceId: 'scor2',
          macAddress: null,
          ipAddress: null,
          bootedTimestamp: 1702243701625
        },
        {
          deviceType: 'REGISTRATION_SCREEN',
          roomType: 'ADMINISTRATION1',
          deviceId: '001',
          macAddress: null,
          ipAddress: null,
          bootedTimestamp: 1706707719741
        },
        {
          deviceType: 'RPI_READER',
          roomType: 'ADMINISTRATION1',
          deviceId: 'ADMINISTRATION1Reader',
          macAddress: null,
          ipAddress: null,
          bootedTimestamp: 1705889333198
        }
      ]
    }


<a id="org98d78be"></a>

### Client response

    {
      ok: true,
      devices: [
        {
          id: 'scor1',
          type: 'SCOREBOARD_SCREEN',
          room: 'SCOREBOARD1',
          view: null
        },
        {
          id: 'scor2',
          type: 'SCOREBOARD_SCREEN',
          room: 'SCOREBOARD2',
          view: null
        },
        {
          id: '001',
          type: 'REGISTRATION_SCREEN',
          room: 'ADMINISTRATION1',
          view: null
        },
        {
          id: 'ADMINISTRATION1Reader',
          type: 'RPI_READER',
          room: 'ADMINISTRATION1',
          view: null
        }
      ]
    }


<a id="orgae8a017"></a>

## List Scoreboard Devices


<a id="org3c8ec48"></a>

### Client request

    // 1st argument, optional, options
    {
      queue: true | false
    }


<a id="org309a696"></a>

### Backend request

    {
      timestamp: 1706711522546,
    }


<a id="org26335a7"></a>

### Backend response

    {
      timestamp: 1706711522546,
      result: 'OK',
      scoreboardDevices: [
        {
          deviceId: 'scor1',
          deviceType: 'SCOREBOARD_SCREEN',
          roomType: 'SCOREBOARD1',
          status: 'ROTATING'
        },
        {
          deviceId: 'scor2',
          deviceType: 'SCOREBOARD_SCREEN',
          roomType: 'SCOREBOARD2',
          status: 'MONTHLY'
        }
      ]
    }


<a id="orgac55f28"></a>

### Client response

    {
      ok: true,
      scoreboardDevices: [
        {
          id: 'scor1',
          type: 'SCOREBOARD_SCREEN',
          room: 'SCOREBOARD1',
          view: 'ROTATING'
        },
        {
          id: 'scor2',
          type: 'SCOREBOARD_SCREEN',
          room: 'SCOREBOARD2',
          view: 'MONTHLY'
        }
      ]
    }


<a id="org561e2e8"></a>

## List Scoreboard Device Views
