docs/api.org
*** Backend response
#+begin_src js
  {
    timestamp: 1706712075044,
    result: 'OK',
    scoreboardStatuses: [
      'ROTATING',
      'ALL_TIME',
      'MONTHLY',
      'WEEKLY',
      'DAILY',
      'ELEMENTS',
      'ROOMS'
    ]
  }
#+end_src

*** Client response
#+begin_src js
  {
    ok: true,
    scoreboardViews: [
      'ROTATING',
      'ALL_TIME',
      'MONTHLY',
      'WEEKLY',
      'DAILY',
      'ELEMENTS',
      'ROOMS'
    ]
  }
#+end_src

** Update Scoreboard Device View
*** Client request
#+begin_src js
  // 1st argument, device
  {
    id: 'scor1',
    type: 'SCOREBOARD_SCREEN',
    room: 'SCOREBOARD1',
    view: 'ROTATING'
  }

  // 2nd argument, new View
  view: "string",

  // 3rd argument, options, optional
  {
    queue: true || false
  }
#+end_src
*** Backend request
#+begin_src js
  {
    timestamp : 1707072209571,
    deviceId : "scor1",
    status : "WEEKLY"
  }
#+end_src

*** Backend response
#+begin_src js
  {
    timestamp : 1707072209641,
    result : "OK"
  }
#+end_src
*** Client response
#+begin_src js
  {
    ok: true,
    device: {
      id: 'scor1',
      type: 'SCOREBOARD_SCREEN',
      room: 'SCOREBOARD1',
      view: 'new view'
    }
  }
#+end_src

** Boot Device
*** Client request
#+begin_src js
  // 1st argument, optional, device
  {
    id: "",
  }
  // 2nd argument, optional, options
  {
    queue: true | false
  }
#+end_src
*** Backend request
#+begin_src js
  // Boot the device identified by deviceId
  {
    timestamp: 1706724066778,
    devicesAction: "WAKE_UP",
    deviceId: "someDevice"
  }

  // Boot all devices
  {
    timestamp: 1706724066778,
    devicesAction: "WAKEUP_ALL",
    deviceId: "",
  }
#+end_src
*** Backend response
#+begin_src js
  {
    timestamp: 1706724066778,
    result: 'OK',
    message: 'action executed'
  }
#+end_src
*** Client response
#+begin_src js
  {
    device: null || {
      id: "",
    }
  }
#+end_src

** Shutdown Device
*** Client request
#+begin_src js
  // 1st argument, optional, device
  {
    id: "",
  }
  // 2nd argument, optional, options
  {
    queue: true | false
  }
#+end_src
