docs/api.html
<div id="outline-container-org669faaf" class="outline-4">
<h4 id="org669faaf"><span class="section-number-4">2.3.1.</span> Client request</h4>
<div class="outline-text-4" id="text-2-3-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, optional, options</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> | <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org536f4fb" class="outline-4">
<h4 id="org536f4fb"><span class="section-number-4">2.3.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-2-3-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706712075044</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org494e478" class="outline-4">
<h4 id="org494e478"><span class="section-number-4">2.3.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-2-3-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706712075044</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  scoreboardStatuses: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">'ROTATING'</span>,
    <span style="color: #2d9574;">'ALL_TIME'</span>,
    <span style="color: #2d9574;">'MONTHLY'</span>,
    <span style="color: #2d9574;">'WEEKLY'</span>,
    <span style="color: #2d9574;">'DAILY'</span>,
    <span style="color: #2d9574;">'ELEMENTS'</span>,
    <span style="color: #2d9574;">'ROOMS'</span>
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd2f5f43" class="outline-4">
<h4 id="orgd2f5f43"><span class="section-number-4">2.3.4.</span> Client response</h4>
<div class="outline-text-4" id="text-2-3-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  scoreboardViews: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">'ROTATING'</span>,
    <span style="color: #2d9574;">'ALL_TIME'</span>,
    <span style="color: #2d9574;">'MONTHLY'</span>,
    <span style="color: #2d9574;">'WEEKLY'</span>,
    <span style="color: #2d9574;">'DAILY'</span>,
    <span style="color: #2d9574;">'ELEMENTS'</span>,
    <span style="color: #2d9574;">'ROOMS'</span>
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0632711" class="outline-3">
<h3 id="org0632711"><span class="section-number-3">2.4.</span> Update Scoreboard Device View</h3>
<div class="outline-text-3" id="text-2-4">
</div>
<div id="outline-container-org30562de" class="outline-4">
<h4 id="org30562de"><span class="section-number-4">2.4.1.</span> Client request</h4>
<div class="outline-text-4" id="text-2-4-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, device</span>
<span style="color: #4f97d7;">{</span>
  id: <span style="color: #2d9574;">'scor1'</span>,
  type: <span style="color: #2d9574;">'SCOREBOARD_SCREEN'</span>,
  room: <span style="color: #2d9574;">'SCOREBOARD1'</span>,
  view: <span style="color: #2d9574;">'ROTATING'</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2nd argument, new View</span>
view: <span style="color: #2d9574;">"string"</span>,

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">3rd argument, options, optional</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> || <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org37862f5" class="outline-4">
<h4 id="org37862f5"><span class="section-number-4">2.4.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-2-4-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1707072209571</span>,
  deviceId : <span style="color: #2d9574;">"scor1"</span>,
  status : <span style="color: #2d9574;">"WEEKLY"</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org10cda86" class="outline-4">
<h4 id="org10cda86"><span class="section-number-4">2.4.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-2-4-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1707072209641</span>,
  result : <span style="color: #2d9574;">"OK"</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org992df7d" class="outline-4">
<h4 id="org992df7d"><span class="section-number-4">2.4.4.</span> Client response</h4>
<div class="outline-text-4" id="text-2-4-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  device: <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #2d9574;">'scor1'</span>,
    type: <span style="color: #2d9574;">'SCOREBOARD_SCREEN'</span>,
    room: <span style="color: #2d9574;">'SCOREBOARD1'</span>,
    view: <span style="color: #2d9574;">'new view'</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org11cd796" class="outline-3">
<h3 id="org11cd796"><span class="section-number-3">2.5.</span> Boot Device</h3>
<div class="outline-text-3" id="text-2-5">
</div>
<div id="outline-container-org1d7a9e2" class="outline-4">
<h4 id="org1d7a9e2"><span class="section-number-4">2.5.1.</span> Client request</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, optional, device</span>
<span style="color: #4f97d7;">{</span>
  id: <span style="color: #2d9574;">""</span>,
<span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2nd argument, optional, options</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> | <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1694b86" class="outline-4">
<h4 id="org1694b86"><span class="section-number-4">2.5.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Boot the device identified by deviceId</span>
<span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706724066778</span>,
  devicesAction: <span style="color: #2d9574;">"WAKE_UP"</span>,
  deviceId: <span style="color: #2d9574;">"someDevice"</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Boot all devices</span>
<span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706724066778</span>,
  devicesAction: <span style="color: #2d9574;">"WAKEUP_ALL"</span>,
  deviceId: <span style="color: #2d9574;">""</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
