docs/api.md


<a id="orga5a54c7"></a>

### Client request

    // 1st argument, optional, options
    {
      queue: true | false
    }


<a id="org0575693"></a>

### Backend request

    {
      timestamp: 1706712075044,
    }


<a id="org75e2baa"></a>

### Backend response

    {
      timestamp: 1706712075044,
      result: 'OK',
      scoreboardStatuses: [
        'ROTATING',
        'ALL_TIME',
        'MONTHLY',
        'WEEKLY',
        'DAILY',
        'ELEMENTS',
        'ROOMS'
      ]
    }


<a id="org1283876"></a>

### Client response

    {
      ok: true,
      scoreboardViews: [
        'ROTATING',
        'ALL_TIME',
        'MONTHLY',
        'WEEKLY',
        'DAILY',
        'ELEMENTS',
        'ROOMS'
      ]
    }


<a id="orgce2d5b5"></a>

## Update Scoreboard Device View


<a id="org4dca0f0"></a>

### Client request

    // 1st argument, device
    {
      id: 'scor1',
      type: 'SCOREBOARD_SCREEN',
      room: 'SCOREBOARD1',
      view: 'ROTATING'
    }
    
    // 2nd argument, new View
    view: "string",
    
    // 3rd argument, options, optional
    {
      queue: true || false
    }


<a id="org7d1240a"></a>

### Backend request

    {
      timestamp : 1707072209571,
      deviceId : "scor1",
      status : "WEEKLY"
    }


<a id="org4eeb162"></a>

### Backend response

    {
      timestamp : 1707072209641,
      result : "OK"
    }


<a id="org1945097"></a>

### Client response

    {
      ok: true,
      device: {
        id: 'scor1',
        type: 'SCOREBOARD_SCREEN',
        room: 'SCOREBOARD1',
        view: 'new view'
      }
    }


<a id="org0df4fba"></a>

## Boot Device


<a id="org1fb4b52"></a>

### Client request

    // 1st argument, optional, device
    {
      id: "",
    }
    // 2nd argument, optional, options
    {
      queue: true | false
    }


<a id="org873481f"></a>

### Backend request

    // Boot the device identified by deviceId
    {
      timestamp: 1706724066778,
      devicesAction: "WAKE_UP",
      deviceId: "someDevice"
    }
    
    // Boot all devices
    {
      timestamp: 1706724066778,
      devicesAction: "WAKEUP_ALL",
      deviceId: "",
    }
