docs/api.org
*** Backend request
#+begin_src js
  // Shutdown the device identified by deviceId
  {
    timestamp: 1706724066778,
    devicesAction: "SHUTDOWN",
    deviceId: "someDevice"
  }

  // Shutdown all devices
  {
    timestamp: 1706724066778,
    devicesAction: "SHUTDOWN_ALL",
    deviceId: "",
  }
#+end_src
*** Backend response
#+begin_src js
  {
    timestamp: 1706726298103,
    result: 'OK',
    message: 'action executed'
  }
#+end_src
*** Client response
#+begin_src js
  {
    ok: true,
    device: null || {
      id: ""
    }
  }
    #+end_src

** Restart Device
*** Client request
#+begin_src js
  // 1st argument, optional, device
  {
    id: "",
  }
  // 2nd argument, optional, options
  {
    queue: true | false
  }
#+end_src
*** Backend request
#+begin_src js
  // Shutdown the device identified by deviceId
  {
    timestamp: 1706724066778,
    devicesAction: "RESTART",
    deviceId: "someDevice"
  }

  // Shutdown all devices
  {
    timestamp: 1706724066778,
    devicesAction: "RESTART_ALL",
    deviceId: "",
  }
#+end_src
*** Backend response
#+begin_src js
  { timestamp: 1706726929389,
    result: 'OK',
    message: 'action executed'
  }
#+end_src
*** Client response
#+begin_src js
  {
    ok: true,
    device: null || {
      id: ""
    }
  }
#+end_src


* Scoreboard Tasks
** List Scoreboard
*** Client request
#+begin_src js
  // 1st argument, optional, options
  {
    queue: true | false
  }
#+end_src
*** Backend request
#+begin_src js
  {
    timestamp: 1706716622912,
  }
#+end_src
