docs/api.html
<div id="outline-container-org972be22" class="outline-4">
<h4 id="org972be22"><span class="section-number-4">2.5.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-2-5-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706724066778</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  message: <span style="color: #2d9574;">'action executed'</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org419cadf" class="outline-4">
<h4 id="org419cadf"><span class="section-number-4">2.5.4.</span> Client response</h4>
<div class="outline-text-4" id="text-2-5-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  device: <span style="color: #a45bad;">null</span> || <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #2d9574;">""</span>,
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org32d9945" class="outline-3">
<h3 id="org32d9945"><span class="section-number-3">2.6.</span> Shutdown Device</h3>
<div class="outline-text-3" id="text-2-6">
</div>
<div id="outline-container-orgdb71b66" class="outline-4">
<h4 id="orgdb71b66"><span class="section-number-4">2.6.1.</span> Client request</h4>
<div class="outline-text-4" id="text-2-6-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, optional, device</span>
<span style="color: #4f97d7;">{</span>
  id: <span style="color: #2d9574;">""</span>,
<span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2nd argument, optional, options</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> | <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org54472b4" class="outline-4">
<h4 id="org54472b4"><span class="section-number-4">2.6.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-2-6-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Shutdown the device identified by deviceId</span>
<span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706724066778</span>,
  devicesAction: <span style="color: #2d9574;">"SHUTDOWN"</span>,
  deviceId: <span style="color: #2d9574;">"someDevice"</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Shutdown all devices</span>
<span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706724066778</span>,
  devicesAction: <span style="color: #2d9574;">"SHUTDOWN_ALL"</span>,
  deviceId: <span style="color: #2d9574;">""</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge65038e" class="outline-4">
<h4 id="orge65038e"><span class="section-number-4">2.6.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-2-6-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706726298103</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  message: <span style="color: #2d9574;">'action executed'</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf145106" class="outline-4">
<h4 id="orgf145106"><span class="section-number-4">2.6.4.</span> Client response</h4>
<div class="outline-text-4" id="text-2-6-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  device: <span style="color: #a45bad;">null</span> || <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #2d9574;">""</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org4b08c6e" class="outline-3">
<h3 id="org4b08c6e"><span class="section-number-3">2.7.</span> Restart Device</h3>
<div class="outline-text-3" id="text-2-7">
</div>
<div id="outline-container-org33110d8" class="outline-4">
<h4 id="org33110d8"><span class="section-number-4">2.7.1.</span> Client request</h4>
<div class="outline-text-4" id="text-2-7-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, optional, device</span>
<span style="color: #4f97d7;">{</span>
  id: <span style="color: #2d9574;">""</span>,
<span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2nd argument, optional, options</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> | <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orge1e9c65" class="outline-4">
<h4 id="orge1e9c65"><span class="section-number-4">2.7.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-2-7-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Shutdown the device identified by deviceId</span>
<span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706724066778</span>,
  devicesAction: <span style="color: #2d9574;">"RESTART"</span>,
  deviceId: <span style="color: #2d9574;">"someDevice"</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Shutdown all devices</span>
<span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706724066778</span>,
  devicesAction: <span style="color: #2d9574;">"RESTART_ALL"</span>,
  deviceId: <span style="color: #2d9574;">""</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org76cc8e5" class="outline-4">
<h4 id="org76cc8e5"><span class="section-number-4">2.7.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-2-7-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span> timestamp: <span style="color: #a45bad;">1706726929389</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  message: <span style="color: #2d9574;">'action executed'</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orga528075" class="outline-4">
<h4 id="orga528075"><span class="section-number-4">2.7.4.</span> Client response</h4>
<div class="outline-text-4" id="text-2-7-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  device: <span style="color: #a45bad;">null</span> || <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #2d9574;">""</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-org04b9cf8" class="outline-2">
<h2 id="org04b9cf8"><span class="section-number-2">3.</span> Scoreboard Tasks</h2>
<div class="outline-text-2" id="text-3">
</div>
