docs/api.md


<a id="orgead370e"></a>

### Backend response

    {
      timestamp: 1706724066778,
      result: 'OK',
      message: 'action executed'
    }


<a id="org7e25882"></a>

### Client response

    {
      device: null || {
        id: "",
      }
    }


<a id="org8bcc155"></a>

## Shutdown Device


<a id="org937bb5c"></a>

### Client request

    // 1st argument, optional, device
    {
      id: "",
    }
    // 2nd argument, optional, options
    {
      queue: true | false
    }


<a id="orge5c39c1"></a>

### Backend request

    // Shutdown the device identified by deviceId
    {
      timestamp: 1706724066778,
      devicesAction: "SHUTDOWN",
      deviceId: "someDevice"
    }
    
    // Shutdown all devices
    {
      timestamp: 1706724066778,
      devicesAction: "SHUTDOWN_ALL",
      deviceId: "",
    }


<a id="org8c0d951"></a>

### Backend response

    {
      timestamp: 1706726298103,
      result: 'OK',
      message: 'action executed'
    }


<a id="org4884c36"></a>

### Client response

    {
      ok: true,
      device: null || {
        id: ""
      }
    }


<a id="orga338a8b"></a>

## Restart Device


<a id="org9b9d9f2"></a>

### Client request

    // 1st argument, optional, device
    {
      id: "",
    }
    // 2nd argument, optional, options
    {
      queue: true | false
    }


<a id="org198af43"></a>

### Backend request

    // Shutdown the device identified by deviceId
    {
      timestamp: 1706724066778,
      devicesAction: "RESTART",
      deviceId: "someDevice"
    }
    
    // Shutdown all devices
    {
      timestamp: 1706724066778,
      devicesAction: "RESTART_ALL",
      deviceId: "",
    }


<a id="orgeec90da"></a>

### Backend response

    { timestamp: 1706726929389,
      result: 'OK',
      message: 'action executed'
    }


<a id="orgcf06bd7"></a>

### Client response

    {
      ok: true,
      device: null || {
        id: ""
      }
    }


<a id="orgf23112c"></a>

# Scoreboard Tasks
