docs/api.org
*** Client response
#+begin_src js
  {
    ok: true,
    scoreboard: {
      roomElementAssociations: ctx.raw.roomElementAssociations,
      live: ctx.raw.live,
      teamAllTime: ctx.raw.teamAllTime,
      teamMonthly: ctx.raw.teamMonthly,
      teamWeekly: ctx.raw.teamWeekly,
      teamDaily: ctx.raw.teamDaily,
      perRoom: ctx.raw.perRoom,
      perElement: ctx.raw.perElement,
    }
  }
#+end_src


* Player Tasks
** List Registered Players
*** Client request
#+begin_src js
  // arg #1, optional, options
  {
    queue: true | false,
  }
#+end_src
*** Backend request
#+begin_src js
  {
    timestamp: 1706642934817,
  }
#+end_src
*** Backend response
#+begin_src js
  {
    timestamp: 1706642934817,
    result: 'OK',
    players: [
      {
        username: 'Merry_2mpmnxcgv1s',
        name: 'Merry',
        surname: 'compassionate',
        email: 'Merry@gmail.com',
        wristbandMerged: false,
        wristband: null
      },
      {
        username: 'Wormtongue_klagnkjxqla',
        name: 'Wormtongue',
        surname: 'jovial',
        email: 'Wormtongue@gmail.com',
        wristbandMerged: false,
        wristband: { wristbandNumber: 230, wristbandColor: 3, active: true }
      },
      {
        username: '6t3o5ds227u',
        name: null,
        surname: null,
        email: null,
        wristbandMerged: false,
        wristband: null
      },
      {
        username: 'Elrond_6ofeexn83ma',
        name: 'Elrond',
        surname: 'vigilant',
        email: 'Elrond@gmail.com',
        wristbandMerged: true,
        wristband: { wristbandNumber: 231, wristbandColor: 4, active: true }
      },
      {
        username: 'ppthree',
        name: 'yolothree',
        surname: 'ggthree',
        email: 'ggthree@gmail.com',
        wristbandMerged: false,
        wristband: null
      },
    ]
  }
#+end_src
