docs/api.html

<div id="outline-container-org8cdd62f" class="outline-4">
<h4 id="org8cdd62f"><span class="section-number-4">3.1.4.</span> Client response</h4>
<div class="outline-text-4" id="text-3-1-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  scoreboard: <span style="color: #bc6ec5;">{</span>
    roomElementAssociations: ctx.raw.roomElementAssociations,
    live: ctx.raw.live,
    teamAllTime: ctx.raw.teamAllTime,
    teamMonthly: ctx.raw.teamMonthly,
    teamWeekly: ctx.raw.teamWeekly,
    teamDaily: ctx.raw.teamDaily,
    perRoom: ctx.raw.perRoom,
    perElement: ctx.raw.perElement,
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-org6558f3c" class="outline-2">
<h2 id="org6558f3c"><span class="section-number-2">4.</span> Player Tasks</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org9e5b8d2" class="outline-3">
<h3 id="org9e5b8d2"><span class="section-number-3">4.1.</span> List Registered Players</h3>
<div class="outline-text-3" id="text-4-1">
</div>
<div id="outline-container-org1487eca" class="outline-4">
<h4 id="org1487eca"><span class="section-number-4">4.1.1.</span> Client request</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">arg #1, optional, options</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> | <span style="color: #a45bad;">false</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
