docs/api.md


<a id="org8455e11"></a>

### Client response

    {
      ok: true,
      scoreboard: {
        roomElementAssociations: ctx.raw.roomElementAssociations,
        live: ctx.raw.live,
        teamAllTime: ctx.raw.teamAllTime,
        teamMonthly: ctx.raw.teamMonthly,
        teamWeekly: ctx.raw.teamWeekly,
        teamDaily: ctx.raw.teamDaily,
        perRoom: ctx.raw.perRoom,
        perElement: ctx.raw.perElement,
      }
    }


<a id="org1174430"></a>

# Player Tasks


<a id="org5e5431d"></a>

## List Registered Players


<a id="orgfa137df"></a>

### Client request

    // arg #1, optional, options
    {
      queue: true | false,
    }
