docs/api.org
*** Backend response
#+begin_src js
  const response = {
    timestamp: 1706649848057,
    result: 'OK',
    players: [
      {
        username: 'Gilgalad_wsai1ooow3',
        name: 'Gilgalad',
        surname: 'sweet',
        email: 'Gilgalad@gmail.com',
        wristbandMerged: false,
        wristband: { wristbandNumber: 232, wristbandColor: 4, active: true }
      },
      {
        username: 'Gandalf_deil7sv8j4c',
        name: 'Gandalf',
        surname: 'busy',
        email: 'Gandalf@gmail.com',
        wristbandMerged: false,
        wristband: { wristbandNumber: 233, wristbandColor: 4, active: true }
      },
      {
        username: 'Galadriel_12k3dw52kkhi',
        name: 'Galadriel',
        surname: 'jovial',
        email: 'Galadriel@gmail.com',
        wristbandMerged: false,
        wristband: { wristbandNumber: 235, wristbandColor: 5, active: true }
      }
    ]
  }
#+end_src
*** Client response
#+begin_src js
  {
    ok: true,
    players: [
      {
        username: 'Gilgalad_wsai1ooow3',
        name: 'Gilgalad',
        surname: 'sweet',
        email: 'Gilgalad@gmail.com',
        state: 'registered',
        wristband: { id: 232, color: 'yellow', colorCode: 4, state: 'paired' }
      },
      {
        username: 'Gandalf_deil7sv8j4c',
        name: 'Gandalf',
        surname: 'busy',
        email: 'Gandalf@gmail.com',
        state: 'registered',
        wristband: { id: 233, color: 'yellow', colorCode: 4, state: 'paired' }
      },
      {
        username: 'Galadriel_12k3dw52kkhi',
        name: 'Galadriel',
        surname: 'jovial',
        email: 'Galadriel@gmail.com',
        state: 'registered',
        wristband: { id: 235, color: 'blue', colorCode: 5, state: 'paired' }
      }
    ]
  }
#+end_src

** Search Player
*** Client request
#+begin_src js
  // 1st argument
  searchTerm = "string"

  // 2nd argument, options, optional
  {
    queue: false || true,
  }
#+end_src
*** Backend request
#+begin_src js
  {
    timestamp : 1707068032950,
    searchTerm : "l"
  }
#+end_src
