docs/api.html
<div id="outline-container-orgb758f4f" class="outline-4">
<h4 id="orgb758f4f"><span class="section-number-4">4.2.1.</span> Client request</h4>
<div class="outline-text-4" id="text-4-2-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, optional, options</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> || <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org77faf66" class="outline-4">
<h4 id="org77faf66"><span class="section-number-4">4.2.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-4-2-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706649848057</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfd338a9" class="outline-4">
<h4 id="orgfd338a9"><span class="section-number-4">4.2.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-4-2-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">response</span> = <span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706649848057</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  players: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'Gilgalad_wsai1ooow3'</span>,
      name: <span style="color: #2d9574;">'Gilgalad'</span>,
      surname: <span style="color: #2d9574;">'sweet'</span>,
      email: <span style="color: #2d9574;">'Gilgalad@gmail.com'</span>,
      wristbandMerged: <span style="color: #a45bad;">false</span>,
      wristband: <span style="color: #67b11d;">{</span> wristbandNumber: <span style="color: #a45bad;">232</span>, wristbandColor: <span style="color: #a45bad;">4</span>, active: <span style="color: #a45bad;">true</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'Gandalf_deil7sv8j4c'</span>,
      name: <span style="color: #2d9574;">'Gandalf'</span>,
      surname: <span style="color: #2d9574;">'busy'</span>,
      email: <span style="color: #2d9574;">'Gandalf@gmail.com'</span>,
      wristbandMerged: <span style="color: #a45bad;">false</span>,
      wristband: <span style="color: #67b11d;">{</span> wristbandNumber: <span style="color: #a45bad;">233</span>, wristbandColor: <span style="color: #a45bad;">4</span>, active: <span style="color: #a45bad;">true</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'Galadriel_12k3dw52kkhi'</span>,
      name: <span style="color: #2d9574;">'Galadriel'</span>,
      surname: <span style="color: #2d9574;">'jovial'</span>,
      email: <span style="color: #2d9574;">'Galadriel@gmail.com'</span>,
      wristbandMerged: <span style="color: #a45bad;">false</span>,
      wristband: <span style="color: #67b11d;">{</span> wristbandNumber: <span style="color: #a45bad;">235</span>, wristbandColor: <span style="color: #a45bad;">5</span>, active: <span style="color: #a45bad;">true</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2269e25" class="outline-4">
<h4 id="org2269e25"><span class="section-number-4">4.2.4.</span> Client response</h4>
<div class="outline-text-4" id="text-4-2-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  players: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'Gilgalad_wsai1ooow3'</span>,
      name: <span style="color: #2d9574;">'Gilgalad'</span>,
      surname: <span style="color: #2d9574;">'sweet'</span>,
      email: <span style="color: #2d9574;">'Gilgalad@gmail.com'</span>,
      state: <span style="color: #2d9574;">'registered'</span>,
      wristband: <span style="color: #67b11d;">{</span> id: <span style="color: #a45bad;">232</span>, color: <span style="color: #2d9574;">'yellow'</span>, colorCode: <span style="color: #a45bad;">4</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'Gandalf_deil7sv8j4c'</span>,
      name: <span style="color: #2d9574;">'Gandalf'</span>,
      surname: <span style="color: #2d9574;">'busy'</span>,
      email: <span style="color: #2d9574;">'Gandalf@gmail.com'</span>,
      state: <span style="color: #2d9574;">'registered'</span>,
      wristband: <span style="color: #67b11d;">{</span> id: <span style="color: #a45bad;">233</span>, color: <span style="color: #2d9574;">'yellow'</span>, colorCode: <span style="color: #a45bad;">4</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'Galadriel_12k3dw52kkhi'</span>,
      name: <span style="color: #2d9574;">'Galadriel'</span>,
      surname: <span style="color: #2d9574;">'jovial'</span>,
      email: <span style="color: #2d9574;">'Galadriel@gmail.com'</span>,
      state: <span style="color: #2d9574;">'registered'</span>,
      wristband: <span style="color: #67b11d;">{</span> id: <span style="color: #a45bad;">235</span>, color: <span style="color: #2d9574;">'blue'</span>, colorCode: <span style="color: #a45bad;">5</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc8bd2b8" class="outline-3">
<h3 id="orgc8bd2b8"><span class="section-number-3">4.3.</span> Search Player</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-org1f17f42" class="outline-4">
<h4 id="org1f17f42"><span class="section-number-4">4.3.1.</span> Client request</h4>
<div class="outline-text-4" id="text-4-3-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument</span>
searchTerm = <span style="color: #2d9574;">"string"</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2nd argument, options, optional</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">false</span> || <span style="color: #a45bad;">true</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org174bc0a" class="outline-4">
<h4 id="org174bc0a"><span class="section-number-4">4.3.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-4-3-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1707068032950</span>,
  searchTerm : <span style="color: #2d9574;">"l"</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
