docs/api.md


<a id="org9f45691"></a>

### Client request

    // 1st argument, optional, options
    {
      queue: true || false
    }


<a id="org9a04ef7"></a>

### Backend request

    {
      timestamp: 1706649848057,
    }


<a id="orgccd04ac"></a>

### Backend response

    const response = {
      timestamp: 1706649848057,
      result: 'OK',
      players: [
        {
          username: 'Gilgalad_wsai1ooow3',
          name: 'Gilgalad',
          surname: 'sweet',
          email: 'Gilgalad@gmail.com',
          wristbandMerged: false,
          wristband: { wristbandNumber: 232, wristbandColor: 4, active: true }
        },
        {
          username: 'Gandalf_deil7sv8j4c',
          name: 'Gandalf',
          surname: 'busy',
          email: 'Gandalf@gmail.com',
          wristbandMerged: false,
          wristband: { wristbandNumber: 233, wristbandColor: 4, active: true }
        },
        {
          username: 'Galadriel_12k3dw52kkhi',
          name: 'Galadriel',
          surname: 'jovial',
          email: 'Galadriel@gmail.com',
          wristbandMerged: false,
          wristband: { wristbandNumber: 235, wristbandColor: 5, active: true }
        }
      ]
    }


<a id="orgbb55afa"></a>

### Client response

    {
      ok: true,
      players: [
        {
          username: 'Gilgalad_wsai1ooow3',
          name: 'Gilgalad',
          surname: 'sweet',
          email: 'Gilgalad@gmail.com',
          state: 'registered',
          wristband: { id: 232, color: 'yellow', colorCode: 4, state: 'paired' }
        },
        {
          username: 'Gandalf_deil7sv8j4c',
          name: 'Gandalf',
          surname: 'busy',
          email: 'Gandalf@gmail.com',
          state: 'registered',
          wristband: { id: 233, color: 'yellow', colorCode: 4, state: 'paired' }
        },
        {
          username: 'Galadriel_12k3dw52kkhi',
          name: 'Galadriel',
          surname: 'jovial',
          email: 'Galadriel@gmail.com',
          state: 'registered',
          wristband: { id: 235, color: 'blue', colorCode: 5, state: 'paired' }
        }
      ]
    }


<a id="orgff3ecbe"></a>

## Search Player


<a id="org5aac102"></a>

### Client request

    // 1st argument
    searchTerm = "string"
    
    // 2nd argument, options, optional
    {
      queue: false || true,
    }


<a id="org9e32a80"></a>

### Backend request

    {
      timestamp : 1707068032950,
      searchTerm : "l"
    }
