docs/api.org
*** Backend response
#+begin_src js
  {
    timestamp: 1707067665549,
    result: 'OK',
    players: [
      {
        username: 'jgtcqvlxs6',
        name: 'Tuor',
        surname: 'vigorous',
        email: 'jgtcqvlxs6@gmail.com',
        wristbandMerged: false,
        wristband: null
      },
      {
        username: 'TG96',
        name: null,
        surname: null,
        email: 'TG96@maze.com',
        wristbandMerged: false,
        wristband: null
      },
      {
        username: 'li',
        name: 'Melian',
        surname: 'epic',
        email: 'ki3fc4jx7jp@gmail.com',
        wristbandMerged: false,
        wristband: { wristbandNumber: 329, wristbandColor: null, active: true }
      },
      {
        username: 'lo',
        name: 'Idril',
        surname: 'brave',
        email: 'nsevvxw4ca6@gmail.com',
        wristbandMerged: false,
        wristband: { wristbandNumber: 111, wristbandColor: 2, active: true }
      }

    ]
  }
#+end_src

*** Client response
#+begin_src js
  {
    ok: true,
    players: [
      {
        username: 'pp',
        name: 'pp',
        surname: 'pp',
        email: 'pp@gmail.com',
        state: 'registered',
        wristband: { id: null, color: null, colorCode: null, state: 'unpaired' }
      }
    ]
  }
#+end_src

** Register Player
*** Client request
#+begin_src js
  // 1st argument, required, PlayerCommander
  {
    username: 'test',
    name: 'test',
    surname: 'test',
    email: 'testt@gmail.com',
  },
  // 2nd argument, required password
  password: "testpass"
  // 3rd argument, optional, options
  {
    queue: true || false
  }
#+end_src

*** Backend request
#+begin_src js
  {
    timestamp: 1706724066778,
    username: "test",
    surname: "test",
    name: "test",
    email: "test@gmail.com",
    password: "testpass",
  }
#+end_src

*** Backend response
#+begin_src js
  {
    timestamp : 1706874481773,
    result : "OK",
    player : {
      name : "test",
      surname : "test",
      username : "test",
      email : "test@gmail.com",
      wristbandColor : 0,
    }
  }
#+end_src
*** Client response
#+begin_src js
  {
    ok: true,
    player: {
      username: 'n7rgqxbr0vn',
      name: 'Saruman',
      surname: 'serene',
      email: 'n7rgqxbr0vn@gmail.com',
      state: 'registered',
      wristband: { id: null, color: null, colorCode: null, state: 'unpaired' }
    }
  }
#+end_src


* Wristband Tasks
** Register Wristband
*** Client request
#+begin_src js
  // 1st argument, required, Player
  {
    username: "test",
    name: 'test',
    surname: 'test',
    email: 'testt@gmail.com',
  }
  // 2nd argument, required, Wristband
  {
    id: 3,
    color: 'green',
    colorCode: 3
  }
  // 3rd argument, optional, options
  {
    queue: true || false
  }
#+end_src
*** Backend request
#+begin_src js
  {
    timestamp : 1706957679789,
    username : "diwgp3nrrtf",
    wristbandNumber : 234
  }
#+end_src
