docs/api.html
<div id="outline-container-org318b105" class="outline-4">
<h4 id="org318b105"><span class="section-number-4">4.3.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-4-3-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1707067665549</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  players: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'jgtcqvlxs6'</span>,
      name: <span style="color: #2d9574;">'Tuor'</span>,
      surname: <span style="color: #2d9574;">'vigorous'</span>,
      email: <span style="color: #2d9574;">'jgtcqvlxs6@gmail.com'</span>,
      wristbandMerged: <span style="color: #a45bad;">false</span>,
      wristband: <span style="color: #a45bad;">null</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'TG96'</span>,
      name: <span style="color: #a45bad;">null</span>,
      surname: <span style="color: #a45bad;">null</span>,
      email: <span style="color: #2d9574;">'TG96@maze.com'</span>,
      wristbandMerged: <span style="color: #a45bad;">false</span>,
      wristband: <span style="color: #a45bad;">null</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'li'</span>,
      name: <span style="color: #2d9574;">'Melian'</span>,
      surname: <span style="color: #2d9574;">'epic'</span>,
      email: <span style="color: #2d9574;">'ki3fc4jx7jp@gmail.com'</span>,
      wristbandMerged: <span style="color: #a45bad;">false</span>,
      wristband: <span style="color: #67b11d;">{</span> wristbandNumber: <span style="color: #a45bad;">329</span>, wristbandColor: <span style="color: #a45bad;">null</span>, active: <span style="color: #a45bad;">true</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'lo'</span>,
      name: <span style="color: #2d9574;">'Idril'</span>,
      surname: <span style="color: #2d9574;">'brave'</span>,
      email: <span style="color: #2d9574;">'nsevvxw4ca6@gmail.com'</span>,
      wristbandMerged: <span style="color: #a45bad;">false</span>,
      wristband: <span style="color: #67b11d;">{</span> wristbandNumber: <span style="color: #a45bad;">111</span>, wristbandColor: <span style="color: #a45bad;">2</span>, active: <span style="color: #a45bad;">true</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>

  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org8abb9bb" class="outline-4">
<h4 id="org8abb9bb"><span class="section-number-4">4.3.4.</span> Client response</h4>
<div class="outline-text-4" id="text-4-3-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  players: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span>
      username: <span style="color: #2d9574;">'pp'</span>,
      name: <span style="color: #2d9574;">'pp'</span>,
      surname: <span style="color: #2d9574;">'pp'</span>,
      email: <span style="color: #2d9574;">'pp@gmail.com'</span>,
      state: <span style="color: #2d9574;">'registered'</span>,
      wristband: <span style="color: #67b11d;">{</span> id: <span style="color: #a45bad;">null</span>, color: <span style="color: #a45bad;">null</span>, colorCode: <span style="color: #a45bad;">null</span>, state: <span style="color: #2d9574;">'unpaired'</span> <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgea06395" class="outline-3">
<h3 id="orgea06395"><span class="section-number-3">4.4.</span> Register Player</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-org85d9df8" class="outline-4">
<h4 id="org85d9df8"><span class="section-number-4">4.4.1.</span> Client request</h4>
<div class="outline-text-4" id="text-4-4-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, required, PlayerCommander</span>
<span style="color: #4f97d7;">{</span>
  username: <span style="color: #2d9574;">'test'</span>,
  name: <span style="color: #2d9574;">'test'</span>,
  surname: <span style="color: #2d9574;">'test'</span>,
  email: <span style="color: #2d9574;">'testt@gmail.com'</span>,
<span style="color: #4f97d7;">}</span>,
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2nd argument, required password</span>
password: <span style="color: #2d9574;">"testpass"</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">3rd argument, optional, options</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> || <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0902fdb" class="outline-4">
<h4 id="org0902fdb"><span class="section-number-4">4.4.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-4-4-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706724066778</span>,
  username: <span style="color: #2d9574;">"test"</span>,
  surname: <span style="color: #2d9574;">"test"</span>,
  name: <span style="color: #2d9574;">"test"</span>,
  email: <span style="color: #2d9574;">"test@gmail.com"</span>,
  password: <span style="color: #2d9574;">"testpass"</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc9160c5" class="outline-4">
<h4 id="orgc9160c5"><span class="section-number-4">4.4.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-4-4-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1706874481773</span>,
  result : <span style="color: #2d9574;">"OK"</span>,
  player : <span style="color: #bc6ec5;">{</span>
    name : <span style="color: #2d9574;">"test"</span>,
    surname : <span style="color: #2d9574;">"test"</span>,
    username : <span style="color: #2d9574;">"test"</span>,
    email : <span style="color: #2d9574;">"test@gmail.com"</span>,
    wristbandColor : <span style="color: #a45bad;">0</span>,
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd79b7e0" class="outline-4">
<h4 id="orgd79b7e0"><span class="section-number-4">4.4.4.</span> Client response</h4>
<div class="outline-text-4" id="text-4-4-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  player: <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">'n7rgqxbr0vn'</span>,
    name: <span style="color: #2d9574;">'Saruman'</span>,
    surname: <span style="color: #2d9574;">'serene'</span>,
    email: <span style="color: #2d9574;">'n7rgqxbr0vn@gmail.com'</span>,
    state: <span style="color: #2d9574;">'registered'</span>,
    wristband: <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">null</span>, color: <span style="color: #a45bad;">null</span>, colorCode: <span style="color: #a45bad;">null</span>, state: <span style="color: #2d9574;">'unpaired'</span> <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-orgfcaf99e" class="outline-2">
<h2 id="orgfcaf99e"><span class="section-number-2">5.</span> Wristband Tasks</h2>
<div class="outline-text-2" id="text-5">
</div>
