docs/api.md


<a id="org7296975"></a>

### Backend response

    {
      timestamp: 1707067665549,
      result: 'OK',
      players: [
        {
          username: 'jgtcqvlxs6',
          name: 'Tuor',
          surname: 'vigorous',
          email: 'jgtcqvlxs6@gmail.com',
          wristbandMerged: false,
          wristband: null
        },
        {
          username: 'TG96',
          name: null,
          surname: null,
          email: 'TG96@maze.com',
          wristbandMerged: false,
          wristband: null
        },
        {
          username: 'li',
          name: 'Melian',
          surname: 'epic',
          email: 'ki3fc4jx7jp@gmail.com',
          wristbandMerged: false,
          wristband: { wristbandNumber: 329, wristbandColor: null, active: true }
        },
        {
          username: 'lo',
          name: 'Idril',
          surname: 'brave',
          email: 'nsevvxw4ca6@gmail.com',
          wristbandMerged: false,
          wristband: { wristbandNumber: 111, wristbandColor: 2, active: true }
        }
    
      ]
    }


<a id="orge1fbf89"></a>

### Client response

    {
      ok: true,
      players: [
        {
          username: 'pp',
          name: 'pp',
          surname: 'pp',
          email: 'pp@gmail.com',
          state: 'registered',
          wristband: { id: null, color: null, colorCode: null, state: 'unpaired' }
        }
      ]
    }


<a id="org35ba583"></a>

## Register Player


<a id="org29e20c2"></a>

### Client request

    // 1st argument, required, PlayerCommander
    {
      username: 'test',
      name: 'test',
      surname: 'test',
      email: 'testt@gmail.com',
    },
    // 2nd argument, required password
    password: "testpass"
    // 3rd argument, optional, options
    {
      queue: true || false
    }


<a id="org0637e7f"></a>

### Backend request

    {
      timestamp: 1706724066778,
      username: "test",
      surname: "test",
      name: "test",
      email: "test@gmail.com",
      password: "testpass",
    }


<a id="org69f5787"></a>

### Backend response

    {
      timestamp : 1706874481773,
      result : "OK",
      player : {
        name : "test",
        surname : "test",
        username : "test",
        email : "test@gmail.com",
        wristbandColor : 0,
      }
    }


<a id="orge03f6b4"></a>

### Client response

    {
      ok: true,
      player: {
        username: 'n7rgqxbr0vn',
        name: 'Saruman',
        surname: 'serene',
        email: 'n7rgqxbr0vn@gmail.com',
        state: 'registered',
        wristband: { id: null, color: null, colorCode: null, state: 'unpaired' }
      }
    }


<a id="org2727b3d"></a>

# Wristband Tasks
