docs/api.org
*** Backend response
#+begin_src js
  {
    timestamp : 1706957679848,
    result : "OK",
    message : "successfully registerWristbandToPlayer"
  }
#+end_src
*** Client response
#+begin_src js
  {
    ok: true,
    player: {
      username: "test",
      name: 'test',
      surname: 'test',
      email: 'testt@gmail.com',
      wristband: {
        id: 3,
        color: "green",
        colorCode: 3,
        state: "paired"
      }
    }
  }
#+end_src

** Deregister Wristband
*** Client request
#+begin_src js
  // 1st argument, required, Player
  {
    username: "test",
    name: 'test',
    surname: 'test',
    email: 'testt@gmail.com',
  }
  // 2nd argument, required, Wristband
  {
    id: 3,
    color: 'green',
    colorCode: 3
  }
  // 3rd argument, optional, options
  {
    queue: true || false
  }
#+end_src

*** Backend request
#+begin_src js
  {
    timestamp : 1706960913052,
    username : "a39hldmki3",
    wristbandNumber : 432
  }
#+end_src

*** Backend response
#+begin_src js
  {
    timestamp : 1706960913123,
    result : "OK",
    message : "successfully unregisterWristbandToPlayer"
  }
#+end_src

*** Client response
#+begin_src js
  {
    ok: true,
    player: {
      username: "test",
      name: 'test',
      surname: 'test',
      email: 'testt@gmail.com',
      wristband: {
        id: 3,
        color: "green",
        colorCode: 3,
        state: "unpaired"
      }
    }
  }
#+end_src

** Get Wristband Information
*** Client request
#+begin_src js
  {
    id: 3,
    colorCode: 3,
    color: "green",
    state: "state",
  }
#+end_src

*** Backend request
#+begin_src js
  {
    timestamp: 1706879364557,
    wristbandNumber: 3
  }
#+end_src

*** Backend response
#+begin_src js
  {
    timestamp: 1706879364557,
    result: 'OK',
    wristband: { wristbandNumber: 3, wristbandColor: 2, active: false }
  }
#+end_src

*** Client response
#+begin_src js
  {
    ok: true
    wristband: {
      id: 3,
      color: 'green',
      colorCode: 3,
      state: 'state',
    },
  }
#+end_src

** Scan Wristband
