docs/api.html
<div id="outline-container-org1618f55" class="outline-3">
<h3 id="org1618f55"><span class="section-number-3">5.1.</span> Register Wristband</h3>
<div class="outline-text-3" id="text-5-1">
</div>
<div id="outline-container-org41b3623" class="outline-4">
<h4 id="org41b3623"><span class="section-number-4">5.1.1.</span> Client request</h4>
<div class="outline-text-4" id="text-5-1-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, required, Player</span>
<span style="color: #4f97d7;">{</span>
  username: <span style="color: #2d9574;">"test"</span>,
  name: <span style="color: #2d9574;">'test'</span>,
  surname: <span style="color: #2d9574;">'test'</span>,
  email: <span style="color: #2d9574;">'testt@gmail.com'</span>,
<span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2nd argument, required, Wristband</span>
<span style="color: #4f97d7;">{</span>
  id: <span style="color: #a45bad;">3</span>,
  color: <span style="color: #2d9574;">'green'</span>,
  colorCode: <span style="color: #a45bad;">3</span>
<span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">3rd argument, optional, options</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> || <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7e5be67" class="outline-4">
<h4 id="org7e5be67"><span class="section-number-4">5.1.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-5-1-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1706957679789</span>,
  username : <span style="color: #2d9574;">"diwgp3nrrtf"</span>,
  wristbandNumber : <span style="color: #a45bad;">234</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org50dd7b8" class="outline-4">
<h4 id="org50dd7b8"><span class="section-number-4">5.1.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-5-1-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1706957679848</span>,
  result : <span style="color: #2d9574;">"OK"</span>,
  message : <span style="color: #2d9574;">"successfully registerWristbandToPlayer"</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org92bc080" class="outline-4">
<h4 id="org92bc080"><span class="section-number-4">5.1.4.</span> Client response</h4>
<div class="outline-text-4" id="text-5-1-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  player: <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">"test"</span>,
    name: <span style="color: #2d9574;">'test'</span>,
    surname: <span style="color: #2d9574;">'test'</span>,
    email: <span style="color: #2d9574;">'testt@gmail.com'</span>,
    wristband: <span style="color: #2d9574;">{</span>
      id: <span style="color: #a45bad;">3</span>,
      color: <span style="color: #2d9574;">"green"</span>,
      colorCode: <span style="color: #a45bad;">3</span>,
      state: <span style="color: #2d9574;">"paired"</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3b74967" class="outline-3">
<h3 id="org3b74967"><span class="section-number-3">5.2.</span> Deregister Wristband</h3>
<div class="outline-text-3" id="text-5-2">
</div>
<div id="outline-container-orgd90bdbb" class="outline-4">
<h4 id="orgd90bdbb"><span class="section-number-4">5.2.1.</span> Client request</h4>
<div class="outline-text-4" id="text-5-2-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, required, Player</span>
<span style="color: #4f97d7;">{</span>
  username: <span style="color: #2d9574;">"test"</span>,
  name: <span style="color: #2d9574;">'test'</span>,
  surname: <span style="color: #2d9574;">'test'</span>,
  email: <span style="color: #2d9574;">'testt@gmail.com'</span>,
<span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2nd argument, required, Wristband</span>
<span style="color: #4f97d7;">{</span>
  id: <span style="color: #a45bad;">3</span>,
  color: <span style="color: #2d9574;">'green'</span>,
  colorCode: <span style="color: #a45bad;">3</span>
<span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">3rd argument, optional, options</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> || <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org1d3e116" class="outline-4">
<h4 id="org1d3e116"><span class="section-number-4">5.2.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-5-2-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1706960913052</span>,
  username : <span style="color: #2d9574;">"a39hldmki3"</span>,
  wristbandNumber : <span style="color: #a45bad;">432</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgba2bbce" class="outline-4">
<h4 id="orgba2bbce"><span class="section-number-4">5.2.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-5-2-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1706960913123</span>,
  result : <span style="color: #2d9574;">"OK"</span>,
  message : <span style="color: #2d9574;">"successfully unregisterWristbandToPlayer"</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org0c886dd" class="outline-4">
<h4 id="org0c886dd"><span class="section-number-4">5.2.4.</span> Client response</h4>
<div class="outline-text-4" id="text-5-2-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  player: <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">"test"</span>,
    name: <span style="color: #2d9574;">'test'</span>,
    surname: <span style="color: #2d9574;">'test'</span>,
    email: <span style="color: #2d9574;">'testt@gmail.com'</span>,
    wristband: <span style="color: #2d9574;">{</span>
      id: <span style="color: #a45bad;">3</span>,
      color: <span style="color: #2d9574;">"green"</span>,
      colorCode: <span style="color: #a45bad;">3</span>,
      state: <span style="color: #2d9574;">"unpaired"</span>
    <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org0b4cba4" class="outline-3">
<h3 id="org0b4cba4"><span class="section-number-3">5.3.</span> Get Wristband Information</h3>
<div class="outline-text-3" id="text-5-3">
</div>
