docs/api.md


<a id="org8d7f454"></a>

## Register Wristband


<a id="org545bfb2"></a>

### Client request

    // 1st argument, required, Player
    {
      username: "test",
      name: 'test',
      surname: 'test',
      email: 'testt@gmail.com',
    }
    // 2nd argument, required, Wristband
    {
      id: 3,
      color: 'green',
      colorCode: 3
    }
    // 3rd argument, optional, options
    {
      queue: true || false
    }


<a id="orgef5bec0"></a>

### Backend request

    {
      timestamp : 1706957679789,
      username : "diwgp3nrrtf",
      wristbandNumber : 234
    }


<a id="orgdf2a67c"></a>

### Backend response

    {
      timestamp : 1706957679848,
      result : "OK",
      message : "successfully registerWristbandToPlayer"
    }


<a id="org271c101"></a>

### Client response

    {
      ok: true,
      player: {
        username: "test",
        name: 'test',
        surname: 'test',
        email: 'testt@gmail.com',
        wristband: {
          id: 3,
          color: "green",
          colorCode: 3,
          state: "paired"
        }
      }
    }


<a id="org1103dd1"></a>

## Deregister Wristband


<a id="orgdfcb8c1"></a>

### Client request

    // 1st argument, required, Player
    {
      username: "test",
      name: 'test',
      surname: 'test',
      email: 'testt@gmail.com',
    }
    // 2nd argument, required, Wristband
    {
      id: 3,
      color: 'green',
      colorCode: 3
    }
    // 3rd argument, optional, options
    {
      queue: true || false
    }


<a id="orge028f44"></a>

### Backend request

    {
      timestamp : 1706960913052,
      username : "a39hldmki3",
      wristbandNumber : 432
    }


<a id="org15e1757"></a>

### Backend response

    {
      timestamp : 1706960913123,
      result : "OK",
      message : "successfully unregisterWristbandToPlayer"
    }


<a id="org37070b1"></a>

### Client response

    {
      ok: true,
      player: {
        username: "test",
        name: 'test',
        surname: 'test',
        email: 'testt@gmail.com',
        wristband: {
          id: 3,
          color: "green",
          colorCode: 3,
          state: "unpaired"
        }
      }
    }


<a id="orged72643"></a>

## Get Wristband Information
