docs/api.org
*** Backend response
#+begin_src js
  {
    timestamp: 1706777994830,
    result: 'OK',
    jwtResponse: {
      jwt: 'eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA',
      id: 74,
      username: '33rksrlppga',
      email: '33rksrlppga@gmail.com',
      roles: [ 'ROLE_CASHIER' ]
    }
  }
#+end_src
*** Client response
#+begin_src js
  {
    ok: true,
    cashier: {
      id: 3,
      username: "test",
      email: "test@gmail.com",
      role: "cashier",
    },
    jwt: 'eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3OTAxMywiZXhwIjoxNzA2ODE1MDEzfQ.KztDiUAgVIjSnY56gU7lrlKU4IRNRY_4N8GKloG5-X92veQwaDCGj4284yHX_XIn_ZjJFEWbPdvhh7C4xsnFCQ'
  }
#+end_src




** Register Cashier
*** Client request
#+begin_src js
  // 1st argument, required, cashier
  {
    username: "test",
    email: "test@gmail.com",
    role: 'test',
  }
  // 2nd argument, required, password
  password: "oteuheno",
  // 3nd argument, optional, options
  {
    queue: true | false
  }
#+end_src

*** Backend request
#+begin_src js
  {
    username: "testCashier",
    email: "testCashier@gmail.com",
    password: "testCashierPassword",
    role: ["ROLE_CASHIER"],
  }
#+end_src
*** Backend response
#+begin_src js
  {
    timestamp: 1706729341301,
    result: 'OK'
  }
#+end_src

*** Client response
#+begin_src js
  {
    ok: true,
    cashier: {
      id: 3
      username: "test",
      email: "test@gmail.com",
      role: "cashier",
    },
    password: "testpass",
  }
#+end_src


** Deregister Cashier
*** Client request
#+begin_src js
  // 1st argument, required, cashier
  {
    id: 3,
    username: "test",
    email: "test@gmail.com",
    role: "cashier",
  }
  // 2nd argument, optional, options
  {
    queue: true | false
  }
#+end_src

*** Backend request
#+begin_src js
  {
    timestamp: 1706732989145,
    username: "tt",
    userId: 3,
  }
#+end_src
