docs/api.html
<div id="outline-container-orgd4de203" class="outline-4">
<h4 id="orgd4de203"><span class="section-number-4">6.2.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-6-2-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706777994830</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  jwtResponse: <span style="color: #bc6ec5;">{</span>
    jwt: <span style="color: #2d9574;">'eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA'</span>,
    id: <span style="color: #a45bad;">74</span>,
    username: <span style="color: #2d9574;">'33rksrlppga'</span>,
    email: <span style="color: #2d9574;">'33rksrlppga@gmail.com'</span>,
    roles: <span style="color: #2d9574;">[</span> <span style="color: #2d9574;">'ROLE_CASHIER'</span> <span style="color: #2d9574;">]</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org161f4cb" class="outline-4">
<h4 id="org161f4cb"><span class="section-number-4">6.2.4.</span> Client response</h4>
<div class="outline-text-4" id="text-6-2-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  cashier: <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #a45bad;">3</span>,
    username: <span style="color: #2d9574;">"test"</span>,
    email: <span style="color: #2d9574;">"test@gmail.com"</span>,
    role: <span style="color: #2d9574;">"cashier"</span>,
  <span style="color: #bc6ec5;">}</span>,
  jwt: <span style="color: #2d9574;">'eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3OTAxMywiZXhwIjoxNzA2ODE1MDEzfQ.KztDiUAgVIjSnY56gU7lrlKU4IRNRY_4N8GKloG5-X92veQwaDCGj4284yHX_XIn_ZjJFEWbPdvhh7C4xsnFCQ'</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>




<div id="outline-container-org4326e9a" class="outline-3">
<h3 id="org4326e9a"><span class="section-number-3">6.3.</span> Register Cashier</h3>
<div class="outline-text-3" id="text-6-3">
</div>
<div id="outline-container-org4c404bb" class="outline-4">
<h4 id="org4c404bb"><span class="section-number-4">6.3.1.</span> Client request</h4>
<div class="outline-text-4" id="text-6-3-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, required, cashier</span>
<span style="color: #4f97d7;">{</span>
  username: <span style="color: #2d9574;">"test"</span>,
  email: <span style="color: #2d9574;">"test@gmail.com"</span>,
  role: <span style="color: #2d9574;">'test'</span>,
<span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2nd argument, required, password</span>
password: <span style="color: #2d9574;">"oteuheno"</span>,
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">3nd argument, optional, options</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> | <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org11200dd" class="outline-4">
<h4 id="org11200dd"><span class="section-number-4">6.3.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-6-3-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  username: <span style="color: #2d9574;">"testCashier"</span>,
  email: <span style="color: #2d9574;">"testCashier@gmail.com"</span>,
  password: <span style="color: #2d9574;">"testCashierPassword"</span>,
  role: <span style="color: #bc6ec5;">[</span><span style="color: #2d9574;">"ROLE_CASHIER"</span><span style="color: #bc6ec5;">]</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org517b4f4" class="outline-4">
<h4 id="org517b4f4"><span class="section-number-4">6.3.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-6-3-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706729341301</span>,
  result: <span style="color: #2d9574;">'OK'</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org671d13b" class="outline-4">
<h4 id="org671d13b"><span class="section-number-4">6.3.4.</span> Client response</h4>
<div class="outline-text-4" id="text-6-3-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  cashier: <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #a45bad;">3</span>
    username: <span style="color: #2d9574;">"test"</span>,
    email: <span style="color: #2d9574;">"test@gmail.com"</span>,
    role: <span style="color: #2d9574;">"cashier"</span>,
  <span style="color: #bc6ec5;">}</span>,
  password: <span style="color: #2d9574;">"testpass"</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-org69c389e" class="outline-3">
<h3 id="org69c389e"><span class="section-number-3">6.4.</span> Deregister Cashier</h3>
<div class="outline-text-3" id="text-6-4">
</div>
