docs/api.md


<a id="orga0d26de"></a>

### Backend response

    {
      timestamp: 1706777994830,
      result: 'OK',
      jwtResponse: {
        jwt: 'eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA',
        id: 74,
        username: '33rksrlppga',
        email: '33rksrlppga@gmail.com',
        roles: [ 'ROLE_CASHIER' ]
      }
    }


<a id="orgd8d2ab7"></a>

### Client response

    {
      ok: true,
      cashier: {
        id: 3,
        username: "test",
        email: "test@gmail.com",
        role: "cashier",
      },
      jwt: 'eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3OTAxMywiZXhwIjoxNzA2ODE1MDEzfQ.KztDiUAgVIjSnY56gU7lrlKU4IRNRY_4N8GKloG5-X92veQwaDCGj4284yHX_XIn_ZjJFEWbPdvhh7C4xsnFCQ'
    }


<a id="orgac6f5c2"></a>

## Register Cashier


<a id="org6ae7cf1"></a>

### Client request

    // 1st argument, required, cashier
    {
      username: "test",
      email: "test@gmail.com",
      role: 'test',
    }
    // 2nd argument, required, password
    password: "oteuheno",
    // 3nd argument, optional, options
    {
      queue: true | false
    }


<a id="orga473317"></a>

### Backend request

    {
      username: "testCashier",
      email: "testCashier@gmail.com",
      password: "testCashierPassword",
      role: ["ROLE_CASHIER"],
    }


<a id="orgde5fb3c"></a>

### Backend response

    {
      timestamp: 1706729341301,
      result: 'OK'
    }


<a id="org49baa9f"></a>

### Client response

    {
      ok: true,
      cashier: {
        id: 3
        username: "test",
        email: "test@gmail.com",
        role: "cashier",
      },
      password: "testpass",
    }


<a id="org5b46335"></a>

## Deregister Cashier
