docs/api.org
*** Backend response
#+begin_src js
  {
    timestamp: 1706732989145,
    result: 'OK',
    cashiers: [
      { id: 1, username: 'pavlos', email: 'pavlosTester123@gmail.com' },
      { id: 5, username: 'testCashier', email: 'testCashier@gmail.com' },
      { id: 6, username: 'testCash', email: 'testCash@gmail.com' },
      { id: 7, username: 'r9rcnpncmrf', email: 'Tom@gmail.com' },
      { id: 8, username: 'ci10l5jm4ip', email: 'Finwe@gmail.com' },
      { id: 9, username: '9r0d6jqctfp', email: 'Elrond@gmail.com' },
      { id: 10, username: 'xi87q2qgu6', email: 'Gimli@gmail.com' },
      { id: 11, username: '2b6rdbkpl6j', email: 'Gilgalad@gmail.com' },
      { id: 13, username: 'mpw14t0s9jg', email: 'Isildur@gmail.com' },
      { id: 14, username: 'qbavrn3kw7', email: 'Aragorn@gmail.com' },
      { id: 15, username: 'jq6ttl0bueg', email: 'Maedhros@gmail.com' },
      { id: 16, username: 'ko1b9haqpqh', email: 'Thorin@gmail.com' },
      { id: 17, username: 'x21gpwr0bnm', email: 'Beren@gmail.com' },
      { id: 18, username: 'face6c6oojv', email: 'Celebrimbor@gmail.com' },
      { id: 19, username: '4i4asuxctvr', email: 'Theoden@gmail.com' },
      { id: 20, username: 'jj7mvpbsco4', email: 'Earendil@gmail.com' }
    ]
  }
#+end_src

*** Client response
#+begin_src js
  {
    ok: true,
    cashier: {
      id: 3,
      username: "test",
      email: "test@gmail.com"
      role: "cashier"
    }
  }
#+end_src



* Package Tasks
** List Packages
*** Client request
#+begin_src js
  // 1st argument, optional, options
  {
    queue: true | false
  }
#+end_src

*** Backend request
#+begin_src js
  // null
#+end_src
