docs/api.html
<div id="outline-container-org3d5207a" class="outline-4">
<h4 id="org3d5207a"><span class="section-number-4">6.4.1.</span> Client request</h4>
<div class="outline-text-4" id="text-6-4-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, required, cashier</span>
<span style="color: #4f97d7;">{</span>
  id: <span style="color: #a45bad;">3</span>,
  username: <span style="color: #2d9574;">"test"</span>,
  email: <span style="color: #2d9574;">"test@gmail.com"</span>,
  role: <span style="color: #2d9574;">"cashier"</span>,
<span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2nd argument, optional, options</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> | <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org09d1bc5" class="outline-4">
<h4 id="org09d1bc5"><span class="section-number-4">6.4.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-6-4-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706732989145</span>,
  username: <span style="color: #2d9574;">"tt"</span>,
  userId: <span style="color: #a45bad;">3</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org8cf89c0" class="outline-4">
<h4 id="org8cf89c0"><span class="section-number-4">6.4.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-6-4-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706732989145</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  cashiers: <span style="color: #bc6ec5;">[</span>
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">1</span>, username: <span style="color: #2d9574;">'pavlos'</span>, email: <span style="color: #2d9574;">'pavlosTester123@gmail.com'</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">5</span>, username: <span style="color: #2d9574;">'testCashier'</span>, email: <span style="color: #2d9574;">'testCashier@gmail.com'</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">6</span>, username: <span style="color: #2d9574;">'testCash'</span>, email: <span style="color: #2d9574;">'testCash@gmail.com'</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">7</span>, username: <span style="color: #2d9574;">'r9rcnpncmrf'</span>, email: <span style="color: #2d9574;">'Tom@gmail.com'</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">8</span>, username: <span style="color: #2d9574;">'ci10l5jm4ip'</span>, email: <span style="color: #2d9574;">'Finwe@gmail.com'</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">9</span>, username: <span style="color: #2d9574;">'9r0d6jqctfp'</span>, email: <span style="color: #2d9574;">'Elrond@gmail.com'</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">10</span>, username: <span style="color: #2d9574;">'xi87q2qgu6'</span>, email: <span style="color: #2d9574;">'Gimli@gmail.com'</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">11</span>, username: <span style="color: #2d9574;">'2b6rdbkpl6j'</span>, email: <span style="color: #2d9574;">'Gilgalad@gmail.com'</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">13</span>, username: <span style="color: #2d9574;">'mpw14t0s9jg'</span>, email: <span style="color: #2d9574;">'Isildur@gmail.com'</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">14</span>, username: <span style="color: #2d9574;">'qbavrn3kw7'</span>, email: <span style="color: #2d9574;">'Aragorn@gmail.com'</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">15</span>, username: <span style="color: #2d9574;">'jq6ttl0bueg'</span>, email: <span style="color: #2d9574;">'Maedhros@gmail.com'</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">16</span>, username: <span style="color: #2d9574;">'ko1b9haqpqh'</span>, email: <span style="color: #2d9574;">'Thorin@gmail.com'</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">17</span>, username: <span style="color: #2d9574;">'x21gpwr0bnm'</span>, email: <span style="color: #2d9574;">'Beren@gmail.com'</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">18</span>, username: <span style="color: #2d9574;">'face6c6oojv'</span>, email: <span style="color: #2d9574;">'Celebrimbor@gmail.com'</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">19</span>, username: <span style="color: #2d9574;">'4i4asuxctvr'</span>, email: <span style="color: #2d9574;">'Theoden@gmail.com'</span> <span style="color: #2d9574;">}</span>,
    <span style="color: #2d9574;">{</span> id: <span style="color: #a45bad;">20</span>, username: <span style="color: #2d9574;">'jj7mvpbsco4'</span>, email: <span style="color: #2d9574;">'Earendil@gmail.com'</span> <span style="color: #2d9574;">}</span>
  <span style="color: #bc6ec5;">]</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
