docs/api.md


<a id="org24f3e82"></a>

### Client request

    // 1st argument, required, cashier
    {
      id: 3,
      username: "test",
      email: "test@gmail.com",
      role: "cashier",
    }
    // 2nd argument, optional, options
    {
      queue: true | false
    }


<a id="org1585cec"></a>

### Backend request

    {
      timestamp: 1706732989145,
      username: "tt",
      userId: 3,
    }


<a id="org134b451"></a>

### Backend response

    {
      timestamp: 1706732989145,
      result: 'OK',
      cashiers: [
        { id: 1, username: 'pavlos', email: 'pavlosTester123@gmail.com' },
        { id: 5, username: 'testCashier', email: 'testCashier@gmail.com' },
        { id: 6, username: 'testCash', email: 'testCash@gmail.com' },
        { id: 7, username: 'r9rcnpncmrf', email: 'Tom@gmail.com' },
        { id: 8, username: 'ci10l5jm4ip', email: 'Finwe@gmail.com' },
        { id: 9, username: '9r0d6jqctfp', email: 'Elrond@gmail.com' },
        { id: 10, username: 'xi87q2qgu6', email: 'Gimli@gmail.com' },
        { id: 11, username: '2b6rdbkpl6j', email: 'Gilgalad@gmail.com' },
        { id: 13, username: 'mpw14t0s9jg', email: 'Isildur@gmail.com' },
        { id: 14, username: 'qbavrn3kw7', email: 'Aragorn@gmail.com' },
        { id: 15, username: 'jq6ttl0bueg', email: 'Maedhros@gmail.com' },
        { id: 16, username: 'ko1b9haqpqh', email: 'Thorin@gmail.com' },
        { id: 17, username: 'x21gpwr0bnm', email: 'Beren@gmail.com' },
        { id: 18, username: 'face6c6oojv', email: 'Celebrimbor@gmail.com' },
        { id: 19, username: '4i4asuxctvr', email: 'Theoden@gmail.com' },
        { id: 20, username: 'jj7mvpbsco4', email: 'Earendil@gmail.com' }
      ]
    }
