docs/api.html

<div id="outline-container-org9d58f1a" class="outline-4">
<h4 id="org9d58f1a"><span class="section-number-4">8.1.4.</span> Client response</h4>
<div class="outline-text-4" id="text-8-1-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  team: <span style="color: #bc6ec5;">{</span>
    name: <span style="color: #2d9574;">'elated_Galadriel_cl4piph2kic'</span>,
    t_created: <span style="color: #a45bad;">1707028052944</span>,
    points: <span style="color: #a45bad;">387</span>,
    packages: <span style="color: #2d9574;">[]</span>,
    roster: <span style="color: #2d9574;">[</span>
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">'lqplk9p1w68'</span>,
        name: <span style="color: #2d9574;">'Finwe'</span>,
        surname: <span style="color: #2d9574;">'laughing'</span>,
        email: <span style="color: #2d9574;">'lqplk9p1w68@gmail.com'</span>,
        state: <span style="color: #2d9574;">'inTeam'</span>,
        wristband: <span style="color: #b1951d;">{</span> id: <span style="color: #a45bad;">351</span>, color: <span style="color: #2d9574;">'red'</span>, colorCode: <span style="color: #a45bad;">1</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #b1951d;">}</span>
      <span style="color: #67b11d;">}</span>,
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">'pgs5ssie3'</span>,
        name: <span style="color: #2d9574;">'Eowyn'</span>,
        surname: <span style="color: #2d9574;">'strange'</span>,
        email: <span style="color: #2d9574;">'pgs5ssie3@gmail.com'</span>,
        state: <span style="color: #2d9574;">'inTeam'</span>,
        wristband: <span style="color: #b1951d;">{</span> id: <span style="color: #a45bad;">253</span>, color: <span style="color: #2d9574;">'orange'</span>, colorCode: <span style="color: #a45bad;">6</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #b1951d;">}</span>
      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">]</span>,
    state: <span style="color: #2d9574;">'registered'</span>,
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3d14772" class="outline-3">
<h3 id="org3d14772"><span class="section-number-3">8.2.</span> Register Team Package</h3>
<div class="outline-text-3" id="text-8-2">
</div>
<div id="outline-container-org6f5e81d" class="outline-4">
<h4 id="org6f5e81d"><span class="section-number-4">8.2.1.</span> Client request</h4>
<div class="outline-text-4" id="text-8-2-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, Team</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #bc6ec5;">{</span>
    name: <span style="color: #2d9574;">'elated_Galadriel_cl4piph2kic'</span>,
    t_created: <span style="color: #a45bad;">null</span>,
    points: <span style="color: #a45bad;">0</span>,
    state: <span style="color: #2d9574;">'unregistered'</span>
    roster: <span style="color: #2d9574;">[</span>
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">'lqplk9p1w68'</span>,
        name: <span style="color: #2d9574;">'Finwe'</span>,
        surname: <span style="color: #2d9574;">'laughing'</span>,
        email: <span style="color: #2d9574;">'lqplk9p1w68@gmail.com'</span>,
        state: <span style="color: #2d9574;">'registered'</span>,
        wristband: <span style="color: #b1951d;">{</span> id: <span style="color: #a45bad;">351</span>, color: <span style="color: #2d9574;">'red'</span>, colorCode: <span style="color: #a45bad;">1</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #b1951d;">}</span>
      <span style="color: #67b11d;">}</span>,
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">'pgs5ssie3'</span>,
        name: <span style="color: #2d9574;">'Eowyn'</span>,
        surname: <span style="color: #2d9574;">'strange'</span>,
        email: <span style="color: #2d9574;">'pgs5ssie3@gmail.com'</span>,
        state: <span style="color: #2d9574;">'registered'</span>,
        wristband: <span style="color: #b1951d;">{</span> id: <span style="color: #a45bad;">253</span>, color: <span style="color: #2d9574;">'orange'</span>, colorCode: <span style="color: #a45bad;">6</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #b1951d;">}</span>
      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">]</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2nd argument, package</span>
<span style="color: #4f97d7;">{</span>
  id: <span style="color: #a45bad;">null</span>,
  name: <span style="color: #2d9574;">'Per Mission 5'</span>,
  type: <span style="color: #2d9574;">'mission'</span>,
  cost: <span style="color: #a45bad;">50</span>,
  t_start: <span style="color: #a45bad;">null</span>,
  t_end: <span style="color: #a45bad;">null</span>,
  amount: <span style="color: #a45bad;">5</span>,
  remainder: <span style="color: #a45bad;">null</span>,
  state: <span style="color: #2d9574;">'unregistered'</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">3rd argument, options</span>
<span style="color: #4f97d7;">{</span> queue: <span style="color: #a45bad;">false</span> || <span style="color: #a45bad;">true</span> <span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org89c699c" class="outline-4">
<h4 id="org89c699c"><span class="section-number-4">8.2.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-8-2-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1707053008561</span>,
  teamName : <span style="color: #2d9574;">"hopeful_Feanor_ng2coekx3lc"</span>,
  name : <span style="color: #2d9574;">"Per Time 30"</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org3683c9c" class="outline-4">
<h4 id="org3683c9c"><span class="section-number-4">8.2.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-8-2-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1707053008626</span>,
  result : <span style="color: #2d9574;">"OK"</span>,
  team : <span style="color: #bc6ec5;">{</span>
    name : <span style="color: #2d9574;">"hopeful_Feanor_ng2coekx3lc"</span>,
    totalPoints : <span style="color: #a45bad;">0</span>,
    teamState : <span style="color: #a45bad;">null</span>,
    created : <span style="color: #a45bad;">null</span>,
    lastRegisterAttempt : <span style="color: #a45bad;">null</span>,
    currentRoster : <span style="color: #2d9574;">{</span>
      version : <span style="color: #a45bad;">1</span>,
      players : <span style="color: #67b11d;">[</span> <span style="color: #b1951d;">{</span>
        username : <span style="color: #2d9574;">"c77r5w5mod2"</span>,
        wristbandNumber : <span style="color: #a45bad;">455</span>,
        wristbandColor : <span style="color: #a45bad;">null</span>
      <span style="color: #b1951d;">}</span>, <span style="color: #b1951d;">{</span>
        username : <span style="color: #2d9574;">"hndfw7wu1a"</span>,
        wristbandNumber : <span style="color: #a45bad;">347</span>,
        wristbandColor : <span style="color: #a45bad;">null</span>
      <span style="color: #b1951d;">}</span> <span style="color: #67b11d;">]</span>
    <span style="color: #2d9574;">}</span>,
    roomType : <span style="color: #a45bad;">null</span>,
    packages : <span style="color: #2d9574;">[</span> <span style="color: #67b11d;">{</span>
      id : <span style="color: #a45bad;">10</span>,
      name : <span style="color: #2d9574;">"Per Time 30"</span>,
      cost : <span style="color: #a45bad;">null</span>,
      started : <span style="color: #a45bad;">null</span>,
      ended : <span style="color: #a45bad;">null</span>,
      duration : <span style="color: #a45bad;">1800</span>.<span style="color: #a45bad;">000000000</span>,
      paused : <span style="color: #a45bad;">false</span>,
      active : <span style="color: #a45bad;">false</span>
    <span style="color: #67b11d;">}</span> <span style="color: #2d9574;">]</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
