docs/api.md


<a id="org439f839"></a>

### Client response

    {
      ok: true,
      team: {
        name: 'elated_Galadriel_cl4piph2kic',
        t_created: 1707028052944,
        points: 387,
        packages: [],
        roster: [
          {
            username: 'lqplk9p1w68',
            name: 'Finwe',
            surname: 'laughing',
            email: 'lqplk9p1w68@gmail.com',
            state: 'inTeam',
            wristband: { id: 351, color: 'red', colorCode: 1, state: 'paired' }
          },
          {
            username: 'pgs5ssie3',
            name: 'Eowyn',
            surname: 'strange',
            email: 'pgs5ssie3@gmail.com',
            state: 'inTeam',
            wristband: { id: 253, color: 'orange', colorCode: 6, state: 'paired' }
          }
        ],
        state: 'registered',
      }
    }


<a id="orga9d7595"></a>

## Register Team Package


<a id="orga15b76d"></a>

### Client request

    // 1st argument, Team
    {
      {
        name: 'elated_Galadriel_cl4piph2kic',
        t_created: null,
        points: 0,
        state: 'unregistered'
        roster: [
          {
            username: 'lqplk9p1w68',
            name: 'Finwe',
            surname: 'laughing',
            email: 'lqplk9p1w68@gmail.com',
            state: 'registered',
            wristband: { id: 351, color: 'red', colorCode: 1, state: 'paired' }
          },
          {
            username: 'pgs5ssie3',
            name: 'Eowyn',
            surname: 'strange',
            email: 'pgs5ssie3@gmail.com',
            state: 'registered',
            wristband: { id: 253, color: 'orange', colorCode: 6, state: 'paired' }
          }
        ]
      }
    }
    
    // 2nd argument, package
    {
      id: null,
      name: 'Per Mission 5',
      type: 'mission',
      cost: 50,
      t_start: null,
      t_end: null,
      amount: 5,
      remainder: null,
      state: 'unregistered'
    }
    
    // 3rd argument, options
    { queue: false || true }


<a id="org6a161f3"></a>

### Backend request

    {
      timestamp : 1707053008561,
      teamName : "hopeful_Feanor_ng2coekx3lc",
      name : "Per Time 30"
    }


<a id="org272b428"></a>

### Backend response

    {
      timestamp : 1707053008626,
      result : "OK",
      team : {
        name : "hopeful_Feanor_ng2coekx3lc",
        totalPoints : 0,
        teamState : null,
        created : null,
        lastRegisterAttempt : null,
        currentRoster : {
          version : 1,
          players : [ {
            username : "c77r5w5mod2",
            wristbandNumber : 455,
            wristbandColor : null
          }, {
            username : "hndfw7wu1a",
            wristbandNumber : 347,
            wristbandColor : null
          } ]
        },
        roomType : null,
        packages : [ {
          id : 10,
          name : "Per Time 30",
          cost : null,
          started : null,
          ended : null,
          duration : 1800.000000000,
          paused : false,
          active : false
        } ]
      }
    }
