docs/api.org
** Deregister Team Package
*** Client request
#+begin_src js
  // 1st argument, Team
  {
    {
      name: 'elated_Galadriel_cl4piph2kic',
      t_created: null,
      points: 0,
      state: 'unregistered'
      roster: [
        {
          username: 'lqplk9p1w68',
          name: 'Finwe',
          surname: 'laughing',
          email: 'lqplk9p1w68@gmail.com',
          state: 'registered',
          wristband: { id: 351, color: 'red', colorCode: 1, state: 'paired' }
        },
        {
          username: 'pgs5ssie3',
          name: 'Eowyn',
          surname: 'strange',
          email: 'pgs5ssie3@gmail.com',
          state: 'registered',
          wristband: { id: 253, color: 'orange', colorCode: 6, state: 'paired' }
        }
      ]
    }
  }

  // 2nd argument, package
  {
    id: null,
    name: 'Per Mission 5',
    type: 'mission',
    cost: 50,
    t_start: null,
    t_end: null,
    amount: 5,
    remainder: null,
    state: 'unregistered'
  }

  // 3rd argument, options
  { queue: false || true }
#+end_src

*** Backend request
#+begin_src js
  {
    timestamp : 1707056780735,
    teamName : "affectionate_Shelob_ct4pqxcce8w",
    packageId : 17
  }
#+end_src
*** Backend response
#+begin_src js
  {
    timestamp : 1707056780791,
    result : "OK",
    team : {
      name : "affectionate_Shelob_ct4pqxcce8w",
      totalPoints : 0,
      teamState : null,
      created : null,
      lastRegisterAttempt : null,
      currentRoster : {
        version : 1,
        players : [ {
          username : "g9781e0di69",
          wristbandNumber : 401,
          wristbandColor : null
        }, {
          username : "18tw5isjpd7e",
          wristbandNumber : 421,
          wristbandColor : null
        } ]
      },
      roomType : null,
      packages : [ ]
    }
  }
#+end_src

*** Client response
#+begin_src js
  {
    ok: true,
    team: {
      ...,
      packages: []
    }
  }
#+end_src

** Start team
*** Client request
#+begin_src js
  // 1st argument, team
  {
    ...
  },

  // 2nd argument options
  { cause: true || false };
#+end_src
*** Backend request
#+begin_src js
  {
    timestamp : 1707060079874,
    teamName : "compassionate_Melian_ktl66x5o73f"
  }
#+end_src
