docs/api.html

<div id="outline-container-orgc922d12" class="outline-4">
<h4 id="orgc922d12"><span class="section-number-4">8.2.4.</span> Client response</h4>
<div class="outline-text-4" id="text-8-2-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  team: <span style="color: #bc6ec5;">{</span>
    ...
    packages: <span style="color: #2d9574;">[</span>
      ...,
      <span style="color: #67b11d;">{</span>
        id: <span style="color: #a45bad;">3</span>,
        name: <span style="color: #2d9574;">'Per Mission 5'</span>,
        type: <span style="color: #2d9574;">"mission"</span>,
        cost: <span style="color: #a45bad;">null</span>,
        amount: <span style="color: #a45bad;">5</span>,
        remainder: <span style="color: #a45bad;">5</span>,
        t_start: <span style="color: #a45bad;">null</span>,
        t_end: <span style="color: #a45bad;">null</span>,
        state: <span style="color: #2d9574;">"registered"</span>,
      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">]</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgd1bce40" class="outline-3">
<h3 id="orgd1bce40"><span class="section-number-3">8.3.</span> Deregister Team Package</h3>
<div class="outline-text-3" id="text-8-3">
</div>
<div id="outline-container-orgf9786b6" class="outline-4">
<h4 id="orgf9786b6"><span class="section-number-4">8.3.1.</span> Client request</h4>
<div class="outline-text-4" id="text-8-3-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, Team</span>
<span style="color: #4f97d7;">{</span>
  <span style="color: #bc6ec5;">{</span>
    name: <span style="color: #2d9574;">'elated_Galadriel_cl4piph2kic'</span>,
    t_created: <span style="color: #a45bad;">null</span>,
    points: <span style="color: #a45bad;">0</span>,
    state: <span style="color: #2d9574;">'unregistered'</span>
    roster: <span style="color: #2d9574;">[</span>
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">'lqplk9p1w68'</span>,
        name: <span style="color: #2d9574;">'Finwe'</span>,
        surname: <span style="color: #2d9574;">'laughing'</span>,
        email: <span style="color: #2d9574;">'lqplk9p1w68@gmail.com'</span>,
        state: <span style="color: #2d9574;">'registered'</span>,
        wristband: <span style="color: #b1951d;">{</span> id: <span style="color: #a45bad;">351</span>, color: <span style="color: #2d9574;">'red'</span>, colorCode: <span style="color: #a45bad;">1</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #b1951d;">}</span>
      <span style="color: #67b11d;">}</span>,
      <span style="color: #67b11d;">{</span>
        username: <span style="color: #2d9574;">'pgs5ssie3'</span>,
        name: <span style="color: #2d9574;">'Eowyn'</span>,
        surname: <span style="color: #2d9574;">'strange'</span>,
        email: <span style="color: #2d9574;">'pgs5ssie3@gmail.com'</span>,
        state: <span style="color: #2d9574;">'registered'</span>,
        wristband: <span style="color: #b1951d;">{</span> id: <span style="color: #a45bad;">253</span>, color: <span style="color: #2d9574;">'orange'</span>, colorCode: <span style="color: #a45bad;">6</span>, state: <span style="color: #2d9574;">'paired'</span> <span style="color: #b1951d;">}</span>
      <span style="color: #67b11d;">}</span>
    <span style="color: #2d9574;">]</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2nd argument, package</span>
<span style="color: #4f97d7;">{</span>
  id: <span style="color: #a45bad;">null</span>,
  name: <span style="color: #2d9574;">'Per Mission 5'</span>,
  type: <span style="color: #2d9574;">'mission'</span>,
  cost: <span style="color: #a45bad;">50</span>,
  t_start: <span style="color: #a45bad;">null</span>,
  t_end: <span style="color: #a45bad;">null</span>,
  amount: <span style="color: #a45bad;">5</span>,
  remainder: <span style="color: #a45bad;">null</span>,
  state: <span style="color: #2d9574;">'unregistered'</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">3rd argument, options</span>
<span style="color: #4f97d7;">{</span> queue: <span style="color: #a45bad;">false</span> || <span style="color: #a45bad;">true</span> <span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orge61d963" class="outline-4">
<h4 id="orge61d963"><span class="section-number-4">8.3.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-8-3-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1707056780735</span>,
  teamName : <span style="color: #2d9574;">"affectionate_Shelob_ct4pqxcce8w"</span>,
  packageId : <span style="color: #a45bad;">17</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb5aedba" class="outline-4">
<h4 id="orgb5aedba"><span class="section-number-4">8.3.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-8-3-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1707056780791</span>,
  result : <span style="color: #2d9574;">"OK"</span>,
  team : <span style="color: #bc6ec5;">{</span>
    name : <span style="color: #2d9574;">"affectionate_Shelob_ct4pqxcce8w"</span>,
    totalPoints : <span style="color: #a45bad;">0</span>,
    teamState : <span style="color: #a45bad;">null</span>,
    created : <span style="color: #a45bad;">null</span>,
    lastRegisterAttempt : <span style="color: #a45bad;">null</span>,
    currentRoster : <span style="color: #2d9574;">{</span>
      version : <span style="color: #a45bad;">1</span>,
      players : <span style="color: #67b11d;">[</span> <span style="color: #b1951d;">{</span>
        username : <span style="color: #2d9574;">"g9781e0di69"</span>,
        wristbandNumber : <span style="color: #a45bad;">401</span>,
        wristbandColor : <span style="color: #a45bad;">null</span>
      <span style="color: #b1951d;">}</span>, <span style="color: #b1951d;">{</span>
        username : <span style="color: #2d9574;">"18tw5isjpd7e"</span>,
        wristbandNumber : <span style="color: #a45bad;">421</span>,
        wristbandColor : <span style="color: #a45bad;">null</span>
      <span style="color: #b1951d;">}</span> <span style="color: #67b11d;">]</span>
    <span style="color: #2d9574;">}</span>,
    roomType : <span style="color: #a45bad;">null</span>,
    packages : <span style="color: #2d9574;">[</span> <span style="color: #2d9574;">]</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgf3984a4" class="outline-4">
<h4 id="orgf3984a4"><span class="section-number-4">8.3.4.</span> Client response</h4>
<div class="outline-text-4" id="text-8-3-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  team: <span style="color: #bc6ec5;">{</span>
    ...,
    packages: <span style="color: #2d9574;">[]</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org3119b1b" class="outline-3">
<h3 id="org3119b1b"><span class="section-number-3">8.4.</span> Start team</h3>
<div class="outline-text-3" id="text-8-4">
</div>
<div id="outline-container-org81b1520" class="outline-4">
<h4 id="org81b1520"><span class="section-number-4">8.4.1.</span> Client request</h4>
<div class="outline-text-4" id="text-8-4-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, team</span>
<span style="color: #4f97d7;">{</span>
  ...
<span style="color: #4f97d7;">}</span>,

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2nd argument options</span>
<span style="color: #4f97d7;">{</span> cause: <span style="color: #a45bad;">true</span> || <span style="color: #a45bad;">false</span> <span style="color: #4f97d7;">}</span>;
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb5c4b2d" class="outline-4">
<h4 id="orgb5c4b2d"><span class="section-number-4">8.4.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-8-4-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1707060079874</span>,
  teamName : <span style="color: #2d9574;">"compassionate_Melian_ktl66x5o73f"</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
