docs/api.org
*** Backend response
#+begin_src js
  {
    timestamp : 1707060079952,
    result : "OK",
    team : {
      name : "compassionate_Melian_ktl66x5o73f",
      totalPoints : 0,
      teamState : null,
      created : null,
      lastRegisterAttempt : null,
      currentRoster : {
        version : 1,
        players : [ {
          username : "cdc0t3lfjfg",
          wristbandNumber : 154,
          wristbandColor : null
        }, {
          username : "97tixfvlwsp",
          wristbandNumber : 255,
          wristbandColor : null
        } ]
      },
      roomType : null,
      packages : [ {
        id : 21,
        name : "Per Mission 10",
        cost : null,
        started : 1707060079921,
        ended : null,
        missions : 10,
        missionsPlayed : 0,
        active : true
      } ]
    }
  }
#+end_src

*** Client response
#+begin_src js
  {
    ...team,
    state: "playing",
  }
#+end_src

** Find Team
*** Client request
#+begin_src js
  // 1st arument
  {
    ...team,
  },
  // 2nd argument, options
  {
    cause: true || false,
  }
#+end_src
*** Client response
#+begin_src js
  {
    team: { ... },
  }
#+end_src


* Session Tasks
** List Session
*** Backend response
#+begin_src js
  {
    timestamp: 1708773525572,
    result: 'OK',
    message: 'No active session'
  }

  // Or
  {
    timestamp: 1709248857023,
    result: 'OK',
    message: '{"session":{"current":true,"created":"2024-02-29 19:10:31.306","ended":"null","started":"2024-02-29 19:10:31.305","updated":"2024-02-29 19:10:31.306"},"user":{"active":true,"id":8,"email":"test@gmail.com","username":"TEST"}}'
  }
#+end_src

*** Client response
#+begin_src js
  {
    session: {
      current: true,
      created: '2024-02-29 19:10:31.306',
      ended: 'null',
      started: '2024-02-29 19:10:31.305',
      updated: '2024-02-29 19:10:31.306',
      user: {
        active: true,
        id: 8,
        email: 'test@gmail.com',
        username: 'TEST'
      },
      active: true
    },
    ok: true,
    msg: 'Successfully retrieved Session'
  }
#+end_src

** Start Session
*** Client request
#+begin_src js
  // 1st argument, required, cashier
  {
    id: 3,
    username: "test",
    email: "test@gmail.com",
    role: "cashier",
  }
  // 2st argument, required, jwt
  {
    jwt: "eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA",
  }
  // 3st argument, optional, options
  {
    queue: true | false
  }
#+end_src
*** Backend request
#+begin_src js
  {
    jwt: "eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA",
  }
#+end_src

*** Backend response
#+begin_src js
  {
    timestamp: 1706780850379,
    result: 'OK',
  }
#+end_src

*** Client request
#+begin_src js
  {
    ok: true,
    cashier: {
      id: 3,
      username: "test",
      email: "test@gmail.com",
      role: "cashier",
    },
    jwt: "eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA",
  }
#+end_src
** Stop Session
