docs/api.html
<div id="outline-container-org51bb6d1" class="outline-4">
<h4 id="org51bb6d1"><span class="section-number-4">8.4.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-8-4-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1707060079952</span>,
  result : <span style="color: #2d9574;">"OK"</span>,
  team : <span style="color: #bc6ec5;">{</span>
    name : <span style="color: #2d9574;">"compassionate_Melian_ktl66x5o73f"</span>,
    totalPoints : <span style="color: #a45bad;">0</span>,
    teamState : <span style="color: #a45bad;">null</span>,
    created : <span style="color: #a45bad;">null</span>,
    lastRegisterAttempt : <span style="color: #a45bad;">null</span>,
    currentRoster : <span style="color: #2d9574;">{</span>
      version : <span style="color: #a45bad;">1</span>,
      players : <span style="color: #67b11d;">[</span> <span style="color: #b1951d;">{</span>
        username : <span style="color: #2d9574;">"cdc0t3lfjfg"</span>,
        wristbandNumber : <span style="color: #a45bad;">154</span>,
        wristbandColor : <span style="color: #a45bad;">null</span>
      <span style="color: #b1951d;">}</span>, <span style="color: #b1951d;">{</span>
        username : <span style="color: #2d9574;">"97tixfvlwsp"</span>,
        wristbandNumber : <span style="color: #a45bad;">255</span>,
        wristbandColor : <span style="color: #a45bad;">null</span>
      <span style="color: #b1951d;">}</span> <span style="color: #67b11d;">]</span>
    <span style="color: #2d9574;">}</span>,
    roomType : <span style="color: #a45bad;">null</span>,
    packages : <span style="color: #2d9574;">[</span> <span style="color: #67b11d;">{</span>
      id : <span style="color: #a45bad;">21</span>,
      name : <span style="color: #2d9574;">"Per Mission 10"</span>,
      cost : <span style="color: #a45bad;">null</span>,
      started : <span style="color: #a45bad;">1707060079921</span>,
      ended : <span style="color: #a45bad;">null</span>,
      missions : <span style="color: #a45bad;">10</span>,
      missionsPlayed : <span style="color: #a45bad;">0</span>,
      active : <span style="color: #a45bad;">true</span>
    <span style="color: #67b11d;">}</span> <span style="color: #2d9574;">]</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org135c228" class="outline-4">
<h4 id="org135c228"><span class="section-number-4">8.4.4.</span> Client response</h4>
<div class="outline-text-4" id="text-8-4-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ...team,
  state: <span style="color: #2d9574;">"playing"</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org82104d6" class="outline-3">
<h3 id="org82104d6"><span class="section-number-3">8.5.</span> Find Team</h3>
<div class="outline-text-3" id="text-8-5">
</div>
<div id="outline-container-org35cfe4a" class="outline-4">
<h4 id="org35cfe4a"><span class="section-number-4">8.5.1.</span> Client request</h4>
<div class="outline-text-4" id="text-8-5-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st arument</span>
<span style="color: #4f97d7;">{</span>
  ...team,
<span style="color: #4f97d7;">}</span>,
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2nd argument, options</span>
<span style="color: #4f97d7;">{</span>
  cause: <span style="color: #a45bad;">true</span> || <span style="color: #a45bad;">false</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb83d524" class="outline-4">
<h4 id="orgb83d524"><span class="section-number-4">8.5.2.</span> Client response</h4>
<div class="outline-text-4" id="text-8-5-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  team: <span style="color: #bc6ec5;">{</span> ... <span style="color: #bc6ec5;">}</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-org34e942b" class="outline-2">
<h2 id="org34e942b"><span class="section-number-2">9.</span> Session Tasks</h2>
<div class="outline-text-2" id="text-9">
</div>
<div id="outline-container-orgff91850" class="outline-3">
<h3 id="orgff91850"><span class="section-number-3">9.1.</span> List Session</h3>
<div class="outline-text-3" id="text-9-1">
</div>
<div id="outline-container-orgae9a498" class="outline-4">
<h4 id="orgae9a498"><span class="section-number-4">9.1.1.</span> Backend response</h4>
<div class="outline-text-4" id="text-9-1-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1708773525572</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  message: <span style="color: #2d9574;">'No active session'</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Or</span>
<span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1709248857023</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  message: <span style="color: #2d9574;">'{"session":{"current":true,"created":"2024-02-29 19:10:31.306","ended":"null","started":"2024-02-29 19:10:31.305","updated":"2024-02-29 19:10:31.306"},"user":{"active":true,"id":8,"email":"test@gmail.com","username":"TEST"}}'</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbc3db77" class="outline-4">
<h4 id="orgbc3db77"><span class="section-number-4">9.1.2.</span> Client response</h4>
<div class="outline-text-4" id="text-9-1-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  session: <span style="color: #bc6ec5;">{</span>
    current: <span style="color: #a45bad;">true</span>,
    created: <span style="color: #2d9574;">'2024-02-29 19:10:31.306'</span>,
    ended: <span style="color: #2d9574;">'null'</span>,
    started: <span style="color: #2d9574;">'2024-02-29 19:10:31.305'</span>,
    updated: <span style="color: #2d9574;">'2024-02-29 19:10:31.306'</span>,
    user: <span style="color: #2d9574;">{</span>
      active: <span style="color: #a45bad;">true</span>,
      id: <span style="color: #a45bad;">8</span>,
      email: <span style="color: #2d9574;">'test@gmail.com'</span>,
      username: <span style="color: #2d9574;">'TEST'</span>
    <span style="color: #2d9574;">}</span>,
    active: <span style="color: #a45bad;">true</span>
  <span style="color: #bc6ec5;">}</span>,
  ok: <span style="color: #a45bad;">true</span>,
  msg: <span style="color: #2d9574;">'Successfully retrieved Session'</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
