docs/api.md


<a id="org52d03d8"></a>

### Backend response

    {
      timestamp : 1707060079952,
      result : "OK",
      team : {
        name : "compassionate_Melian_ktl66x5o73f",
        totalPoints : 0,
        teamState : null,
        created : null,
        lastRegisterAttempt : null,
        currentRoster : {
          version : 1,
          players : [ {
            username : "cdc0t3lfjfg",
            wristbandNumber : 154,
            wristbandColor : null
          }, {
            username : "97tixfvlwsp",
            wristbandNumber : 255,
            wristbandColor : null
          } ]
        },
        roomType : null,
        packages : [ {
          id : 21,
          name : "Per Mission 10",
          cost : null,
          started : 1707060079921,
          ended : null,
          missions : 10,
          missionsPlayed : 0,
          active : true
        } ]
      }
    }


<a id="org0537be4"></a>

### Client response

    {
      ...team,
      state: "playing",
    }


<a id="org54b4aaf"></a>

## Find Team


<a id="orgde78033"></a>

### Client request

    // 1st arument
    {
      ...team,
    },
    // 2nd argument, options
    {
      cause: true || false,
    }


<a id="orgcf3f7a9"></a>

### Client response

    {
      team: { ... },
    }


<a id="org6b765d8"></a>

# Session Tasks


<a id="org888bd75"></a>

## List Session


<a id="orgcedeb19"></a>

### Backend response

    {
      timestamp: 1708773525572,
      result: 'OK',
      message: 'No active session'
    }
    
    // Or
    {
      timestamp: 1709248857023,
      result: 'OK',
      message: '{"session":{"current":true,"created":"2024-02-29 19:10:31.306","ended":"null","started":"2024-02-29 19:10:31.305","updated":"2024-02-29 19:10:31.306"},"user":{"active":true,"id":8,"email":"test@gmail.com","username":"TEST"}}'
    }


<a id="org355fef5"></a>

### Client response

    {
      session: {
        current: true,
        created: '2024-02-29 19:10:31.306',
        ended: 'null',
        started: '2024-02-29 19:10:31.305',
        updated: '2024-02-29 19:10:31.306',
        user: {
          active: true,
          id: 8,
          email: 'test@gmail.com',
          username: 'TEST'
        },
        active: true
      },
      ok: true,
      msg: 'Successfully retrieved Session'
    }
