docs/api.org
*** Client request
#+begin_src js
  // 1st argument, required, cashier
  {
    id: 3,
    username: "test",
    email: "test@gmail.com",
    role: "cashier",
  }
  // 2st argument, required, jwt
  {
    jwt: "eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA",
  }
  // 3st argument, optional, comment
  comment: "Nothing unexpected ever happens!"
  // 4th argument, optional, options
  {
    queue: true | false
  }
#+end_src

*** Backend request
#+begin_src js
  {
    jwt: "eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA",
    comment: "Nothing unexpected ever happens!"
  }
#+end_src

*** Backend response
#+begin_src js
  {
    timestamp: 1706780850379,
    result: 'OK',
  }
#+end_src

*** Client response
#+begin_src js
  {
    ok: true,
    cashier: {
      id: 3,
      username: "test",
      email: "test@gmail.com",
      role: "cashier",
    },
  }
#+end_src

** Stop Sesson force


