docs/api.html

<div id="outline-container-org9745dbf" class="outline-3">
<h3 id="org9745dbf"><span class="section-number-3">9.2.</span> Start Session</h3>
<div class="outline-text-3" id="text-9-2">
</div>
<div id="outline-container-org9bf0e9e" class="outline-4">
<h4 id="org9bf0e9e"><span class="section-number-4">9.2.1.</span> Client request</h4>
<div class="outline-text-4" id="text-9-2-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, required, cashier</span>
<span style="color: #4f97d7;">{</span>
  id: <span style="color: #a45bad;">3</span>,
  username: <span style="color: #2d9574;">"test"</span>,
  email: <span style="color: #2d9574;">"test@gmail.com"</span>,
  role: <span style="color: #2d9574;">"cashier"</span>,
<span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2st argument, required, jwt</span>
<span style="color: #4f97d7;">{</span>
  jwt: <span style="color: #2d9574;">"eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA"</span>,
<span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">3st argument, optional, options</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> | <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org1bac223" class="outline-4">
<h4 id="org1bac223"><span class="section-number-4">9.2.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-9-2-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  jwt: <span style="color: #2d9574;">"eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA"</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga6274e7" class="outline-4">
<h4 id="orga6274e7"><span class="section-number-4">9.2.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-9-2-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706780850379</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb42d96f" class="outline-4">
<h4 id="orgb42d96f"><span class="section-number-4">9.2.4.</span> Client request</h4>
<div class="outline-text-4" id="text-9-2-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  cashier: <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #a45bad;">3</span>,
    username: <span style="color: #2d9574;">"test"</span>,
    email: <span style="color: #2d9574;">"test@gmail.com"</span>,
    role: <span style="color: #2d9574;">"cashier"</span>,
  <span style="color: #bc6ec5;">}</span>,
  jwt: <span style="color: #2d9574;">"eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA"</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orge0cafbe" class="outline-3">
<h3 id="orge0cafbe"><span class="section-number-3">9.3.</span> Stop Session</h3>
<div class="outline-text-3" id="text-9-3">
</div>
<div id="outline-container-orgf75417f" class="outline-4">
<h4 id="orgf75417f"><span class="section-number-4">9.3.1.</span> Client request</h4>
<div class="outline-text-4" id="text-9-3-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">1st argument, required, cashier</span>
<span style="color: #4f97d7;">{</span>
  id: <span style="color: #a45bad;">3</span>,
  username: <span style="color: #2d9574;">"test"</span>,
  email: <span style="color: #2d9574;">"test@gmail.com"</span>,
  role: <span style="color: #2d9574;">"cashier"</span>,
<span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">2st argument, required, jwt</span>
<span style="color: #4f97d7;">{</span>
  jwt: <span style="color: #2d9574;">"eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA"</span>,
<span style="color: #4f97d7;">}</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">3st argument, optional, comment</span>
comment: <span style="color: #2d9574;">"Nothing unexpected ever happens!"</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">4th argument, optional, options</span>
<span style="color: #4f97d7;">{</span>
  queue: <span style="color: #a45bad;">true</span> | <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgd1a85c6" class="outline-4">
<h4 id="orgd1a85c6"><span class="section-number-4">9.3.2.</span> Backend request</h4>
<div class="outline-text-4" id="text-9-3-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  jwt: <span style="color: #2d9574;">"eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA"</span>,
  comment: <span style="color: #2d9574;">"Nothing unexpected ever happens!"</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org89f98b3" class="outline-4">
<h4 id="org89f98b3"><span class="section-number-4">9.3.3.</span> Backend response</h4>
<div class="outline-text-4" id="text-9-3-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706780850379</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-org02dc536" class="outline-4">
<h4 id="org02dc536"><span class="section-number-4">9.3.4.</span> Client response</h4>
<div class="outline-text-4" id="text-9-3-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  ok: <span style="color: #a45bad;">true</span>,
  cashier: <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #a45bad;">3</span>,
    username: <span style="color: #2d9574;">"test"</span>,
    email: <span style="color: #2d9574;">"test@gmail.com"</span>,
    role: <span style="color: #2d9574;">"cashier"</span>,
  <span style="color: #bc6ec5;">}</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org7be7d03" class="outline-3">
<h3 id="org7be7d03"><span class="section-number-3">9.4.</span> Stop Sesson force</h3>
</div>
</div>
