docs/api.md


<a id="org65b658d"></a>

## Start Session


<a id="org4321859"></a>

### Client request

    // 1st argument, required, cashier
    {
      id: 3,
      username: "test",
      email: "test@gmail.com",
      role: "cashier",
    }
    // 2st argument, required, jwt
    {
      jwt: "eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA",
    }
    // 3st argument, optional, options
    {
      queue: true | false
    }


<a id="org60591e9"></a>

### Backend request

    {
      jwt: "eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA",
    }


<a id="orgfa27392"></a>

### Backend response

    {
      timestamp: 1706780850379,
      result: 'OK',
    }


<a id="orgde055bf"></a>

### Client request

    {
      ok: true,
      cashier: {
        id: 3,
        username: "test",
        email: "test@gmail.com",
        role: "cashier",
      },
      jwt: "eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA",
    }


<a id="org2e96869"></a>

## Stop Session


<a id="orgd69c6b0"></a>

### Client request

    // 1st argument, required, cashier
    {
      id: 3,
      username: "test",
      email: "test@gmail.com",
      role: "cashier",
    }
    // 2st argument, required, jwt
    {
      jwt: "eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA",
    }
    // 3st argument, optional, comment
    comment: "Nothing unexpected ever happens!"
    // 4th argument, optional, options
    {
      queue: true | false
    }


<a id="org01c2f02"></a>

### Backend request

    {
      jwt: "eyJhbGciOiJIUzUxMiJ9.eyJzdWIiOiIzM3Jrc3JscHBnYSIsImlhdCI6MTcwNjc3Nzk5NCwiZXhwIjoxNzA2ODEzOTk0fQ.-qZzuKJX0Aitieseid4h2Lxf5RJkpoXWBLzvEk9_8iFObwh8LicI9ZgG6_wfI1GEHOrAyoauv5tV5nX2SxfBGA",
      comment: "Nothing unexpected ever happens!"
    }


<a id="org5296ab4"></a>

### Backend response

    {
      timestamp: 1706780850379,
      result: 'OK',
    }


<a id="orgee59a5c"></a>

### Client response

    {
      ok: true,
      cashier: {
        id: 3,
        username: "test",
        email: "test@gmail.com",
        role: "cashier",
      },
    }


<a id="org45699bd"></a>

## Stop Sesson force
