docs/api.html


<div id="outline-container-orgec173e7" class="outline-2">
<h2 id="orgec173e7"><span class="section-number-2">10.</span> The Command pattern</h2>
<div class="outline-text-2" id="text-10">
<p>
The <b>afmachine</b> or <b>afm</b> for short is the control center of the application.
</p>

<p>
It's API is consumed by invoking any of the public methods of the <b>afm</b>
instance.
</p>

<p>
All API calls are stored under the directory:
</p>

<p>
/src/afmachine/tasks/*
/src/afmachine/synthetic-tasks/*
</p>

<p>
Each of these is usually a wrapper for a backend API call.
</p>

<p>
The backend API calls are found at:
</p>

<p>
/src/afmachine/device/admin-screen/*
/src/afmachine/device/rpi-reader/*
</p>

<p>
The primary function of <b>Afmachine</b> is to allow clients (such as a React
component or the UI in general) to build middleware chains around each Task.
This design model follows loosely the <b>command</b> design pattern. see
(<a href="https://en.wikipedia.org/wiki/Command_pattern">https://en.wikipedia.org/wiki/Command_pattern</a>)
</p>

<p>
Each time an API call is made <b>afm</b> creates a <b>Command</b> for the invoked <b>Task</b>.
A <b>Command</b> represents one instance of a running <b>Task</b>.
</p>

<p>
For example: If a client was to invoke an API call multiple times:
</p>

<p>
afm.listPkgs()
afm.listPkgs()
afm.listPkgs()
</p>

<p>
There would be 3 <b>Commands</b> created for the listPkgs <b>Task</b>.
</p>

<p>
Each <b>Command</b> carries with it a lot of information but fundamentally it
contains a sequence of functions (the middleware chain) to run.
</p>

<p>
When a command is created it is placed into a queue by afm. The afm is
responsible for invoking each the commands in the queue in sequence (meaning in
order, waiting for the completion of one to carry on with the next).
</p>

<p>
For example: If a client was to invoke the API calls:
</p>

<p>
afm.loginCashier();
afm.listPkgs();
afm.logoutCashier();
</p>

<p>
There would be 3 <b>Commands</b> to run in the queue by <b>afm</b>.
It would proceed by running them in these order:
</p>

<ol class="org-ol">
<li>loginCashier()</li>
<li>listPkgs()</li>
<li>logoutCashier()</li>
</ol>

<p>
Clients to afm can register functions that become part of a Command through the
Eventful interface at:
</p>

<p>
/src/Eventful.js
</p>

<p>
For exmaple:
</p>

<p>
// Register a hook to run before each command in the queue.
afm.on('precmd', (afm) =&gt; {});
</p>

<p>
// Register a hook to run after each command in the queue.
afm.on('postcmd', (afm) =&gt; {});
</p>

<p>
// Register a hook to run before each Command for the listPkgs Task.
afm.listPkgs.on('precmd', (command, next) =&gt; {});
</p>

<p>
// Register a hook to run after each Command for the listPkgs Task.
afm.listPkgs.on('postcmd', (command, next) =&gt; {});
</p>
</div>
</div>


<div id="outline-container-orga2d8376" class="outline-2">
<h2 id="orga2d8376"><span class="section-number-2">11.</span> Conventions</h2>
<div class="outline-text-2" id="text-11">
</div>
<div id="outline-container-org546a091" class="outline-3">
<h3 id="org546a091"><span class="section-number-3">11.1.</span> Command inputs and outputs</h3>
<div class="outline-text-3" id="text-11-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  args: <span style="color: #bc6ec5;">{</span>
    ...AFM_FORM_INPUTS
  <span style="color: #bc6ec5;">}</span>
  req: <span style="color: #bc6ec5;">{</span>
    ...BACKEND_FORM_INPUTS
  <span style="color: #bc6ec5;">}</span>
  raw: <span style="color: #bc6ec5;">{</span>
    ...BACKEND_FORM_OUTPUTS
  <span style="color: #bc6ec5;">}</span>
  res: <span style="color: #bc6ec5;">{</span>
    ...AFM_FORM_OUPUTS
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org90f361c" class="outline-3">
<h3 id="org90f361c"><span class="section-number-3">11.2.</span> Commands wrap their return value within an object</h3>
<div class="outline-text-3" id="text-11-2">
<p>
Commands never return an entity object, they return an object that contains the
entity or entities.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Instead of:</span>
<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">response</span> = <span style="color: #4f97d7;">{</span>
  username: <span style="color: #2d9574;">"..."</span>,
  name: <span style="color: #2d9574;">"..."</span>,
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">This:</span>
<span style="color: #4f97d7; font-weight: bold;">const</span> <span style="color: #7590db;">response</span> = <span style="color: #4f97d7;">{</span>
  player: <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">"..."</span>,
    name: <span style="color: #2d9574;">"..."</span>,
  <span style="color: #bc6ec5;">}</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>



<div id="outline-container-org3b73337" class="outline-2">
<h2 id="org3b73337"><span class="section-number-2">12.</span> Normalization functions</h2>
<div class="outline-text-2" id="text-12">
<p>
Normalization function take an array of source objects and combines them into
one object. It is similar to Object.assign(target, &#x2026;sources) but adjusted to
fit the special needs of the ENTITY being normalized. (such as a Player,
Wristband etc). To be more exact, each normalization function is responsible
for:
</p>

<ul class="org-ul">
<li>TRANSLATION of an object in backend form to frontend form.</li>
<li>DEDUCING the state of the entity.</li>
<li>MERGING of multiple sources in any form.</li>
<li>NORMALIZATION of the NESTED entities contained within, if any.</li>
</ul>
</div>
