docs/api.md


<a id="orgb9c79a6"></a>

# The Command pattern

The **afmachine** or **afm** for short is the control center of the application.

It's API is consumed by invoking any of the public methods of the **afm**
instance.

All API calls are stored under the directory:

/src/afmachine/tasks/\*
/src/afmachine/synthetic-tasks/\*

Each of these is usually a wrapper for a backend API call.

The backend API calls are found at:

/src/afmachine/device/admin-screen/\*
/src/afmachine/device/rpi-reader/\*

The primary function of **Afmachine** is to allow clients (such as a React
component or the UI in general) to build middleware chains around each Task.
This design model follows loosely the **command** design pattern. see
(<https://en.wikipedia.org/wiki/Command_pattern>)

Each time an API call is made **afm** creates a **Command** for the invoked **Task**.
A **Command** represents one instance of a running **Task**.

For example: If a client was to invoke an API call multiple times:

afm.listPkgs()
afm.listPkgs()
afm.listPkgs()

There would be 3 **Commands** created for the listPkgs **Task**.

Each **Command** carries with it a lot of information but fundamentally it
contains a sequence of functions (the middleware chain) to run.

When a command is created it is placed into a queue by afm. The afm is
responsible for invoking each the commands in the queue in sequence (meaning in
order, waiting for the completion of one to carry on with the next).

For example: If a client was to invoke the API calls:

afm.loginCashier();
afm.listPkgs();
afm.logoutCashier();

There would be 3 **Commands** to run in the queue by **afm**.
It would proceed by running them in these order:

1.  loginCashier()
2.  listPkgs()
3.  logoutCashier()

Clients to afm can register functions that become part of a Command through the
Eventful interface at:

/src/Eventful.js

For exmaple:

// Register a hook to run before each command in the queue.
afm.on('precmd', (afm) => {});

// Register a hook to run after each command in the queue.
afm.on('postcmd', (afm) => {});

// Register a hook to run before each Command for the listPkgs Task.
afm.listPkgs.on('precmd', (command, next) => {});

// Register a hook to run after each Command for the listPkgs Task.
afm.listPkgs.on('postcmd', (command, next) => {});


<a id="orgff12d70"></a>

# Conventions


<a id="org354ed9d"></a>

## Command inputs and outputs

    {
      args: {
        ...AFM_FORM_INPUTS
      }
      req: {
        ...BACKEND_FORM_INPUTS
      }
      raw: {
        ...BACKEND_FORM_OUTPUTS
      }
      res: {
        ...AFM_FORM_OUPUTS
      }
    }


<a id="orgaae9550"></a>

## Commands wrap their return value within an object

Commands never return an entity object, they return an object that contains the
entity or entities.

    // Instead of:
    const response = {
      username: "...",
      name: "...",
    }
    
    // This:
    const response = {
      player: {
        username: "...",
        name: "...",
      },
    }


<a id="org267309d"></a>

# Normalization functions

Normalization function take an array of source objects and combines them into
one object. It is similar to Object.assign(target, &#x2026;sources) but adjusted to
fit the special needs of the ENTITY being normalized. (such as a Player,
Wristband etc). To be more exact, each normalization function is responsible
for:

-   TRANSLATION of an object in backend form to frontend form.
-   DEDUCING the state of the entity.
-   MERGING of multiple sources in any form.
-   NORMALIZATION of the NESTED entities contained within, if any.
