docs/api.org
** Inputs
All normalization functions accept the following inputs:

- an array of sources, or a single object, or null, or the empty object etc...
- An Options object

To pass along instructions to a NESTED normalization function, one must begin a
secondary nesting in the Options object.

For example:

#+begin_src js
  // Considering a Composite Entity such as a Team which
  // contains within Players with each owning a Wristband and Packages.
  // Team -> Players -> Wristband
  // Team -> Packages
  {
    nullSupersede: true, // Team target
    state: 'registered', // Team Target
    package: { // NESTED TARGET -> Package
      state: "playing",
    }
    player: { // NESTED TARGET -> Player
      state: "inTeam",
    }
    wristband: { // NESTED TARGET -> Player -> Wristband
      state: "paired",
      nullsSupersede: false
    }
  }
#+end_src

** Deducing state
Deducing state is carried on in 2 stages. The goal is to reduce ambiguity an
introduce Determinism.

The first stage is about interpreting the properties that carry with them State.

For example, given a Package with a non-nil id property:

#+begin_src js
  // Package
  {
    id: 5
  }
#+end_src

I could interpret the existence of a non-nil ID property as indicative of
the Package being at least Registered.

But I do not (not in the 1st stage). The only properties used in the first stage
in that EXACT order of a Package normalization function are:

- targetState
  The targetState is passed as an option to the normalization function.
  If it has been defined it interrupts the function and returns immediately
  operating under the assumption that the caller already knows what
  the state of the target should be.
- active
  This property is found in a BackendForm package. If it is defined and true
  it means the Package is currently active.
- state
  This property is found in an AfmForm package.
- defaultState
  The defaultState is passed as an option to the normalization function.
  If no state has been deduced so far in the process, it is used.

The general pattern is that, the targetState has the highest precedence. It is
followed by State backendForm, then by afmForm State, then by defaultState.

In the tobject() functions which must also deduce state the order is:
targetState, afmForm, defaultState.

This is the end of the 1st stage.

The 2nd stage is responsible for binding the Content of the entity to its State.

What do I mean by that?.

Some properties such as:

state or active (in a Package)

are explicitly designed to convey state.

While the other properties in a Package are about its Contents.

#+begin_src js
  {
    id,
    t_started,
    t_ended,
    remainder,
    amount,
    ...
  }
#+end_src

Therefore, one may allocate each Property as belonging to:

- State
- Content

So the 2st stage is about making sure that the target's Contents align with the
State from the 1st stage.

So again carrying on with the above Example:

A Package can be in one of four states:

- Unregistered
- Registered
- Playing
- Completed

(-START NOTE-)
I believe that the architecture of the backend should be based on Packages.
What do I mean?
Instead of having Teams with Packages and Teams having an active Package.
You have Packages with a 'has-a' Team.
So instead of (1)Team-(*)Packages you have a (1)Package-(1)Team.
But it is not, so I make best with what I have.
(-END NOTE-)


Lets say that the target after stage 1 looks like these:

#+begin_src js
  {
    state: 'unregistered'
    id: 5,
    t_start: 100,
    t_end: 500,
  }
#+end_src

This is an example of a misalignment. The State says that this Package
is unregistered but the Contents say that it is Completed.

What should be done in this situation?

In order to help the developer know when a situation like this arises a
state Error is thrown.

So the 2nd stage is responsible for making sure that a misalignment never
occurs.




* Schemas
** Package
