docs/api.html

<div id="outline-container-orgfb36496" class="outline-3">
<h3 id="orgfb36496"><span class="section-number-3">12.1.</span> Inputs</h3>
<div class="outline-text-3" id="text-12-1">
<p>
All normalization functions accept the following inputs:
</p>

<ul class="org-ul">
<li>an array of sources, or a single object, or null, or the empty object etc&#x2026;</li>
<li>An Options object</li>
</ul>

<p>
To pass along instructions to a NESTED normalization function, one must begin a
secondary nesting in the Options object.
</p>

<p>
For example:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Considering a Composite Entity such as a Team which</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">contains within Players with each owning a Wristband and Packages.</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Team -&gt; Players -&gt; Wristband</span>
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Team -&gt; Packages</span>
<span style="color: #4f97d7;">{</span>
  nullSupersede: <span style="color: #a45bad;">true</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Team target</span>
  state: <span style="color: #2d9574;">'registered'</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Team Target</span>
  <span style="color: #4f97d7; font-weight: bold;">package</span>: <span style="color: #bc6ec5;">{</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">NESTED TARGET -&gt; Package</span>
    state: <span style="color: #2d9574;">"playing"</span>,
  <span style="color: #bc6ec5;">}</span>
  player: <span style="color: #bc6ec5;">{</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">NESTED TARGET -&gt; Player</span>
    state: <span style="color: #2d9574;">"inTeam"</span>,
  <span style="color: #bc6ec5;">}</span>
  wristband: <span style="color: #bc6ec5;">{</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">NESTED TARGET -&gt; Player -&gt; Wristband</span>
    state: <span style="color: #2d9574;">"paired"</span>,
    nullsSupersede: <span style="color: #a45bad;">false</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orga2a7e22" class="outline-3">
<h3 id="orga2a7e22"><span class="section-number-3">12.2.</span> Deducing state</h3>
<div class="outline-text-3" id="text-12-2">
<p>
Deducing state is carried on in 2 stages. The goal is to reduce ambiguity an
introduce Determinism.
</p>

<p>
The first stage is about interpreting the properties that carry with them State.
</p>

<p>
For example, given a Package with a non-nil id property:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Package</span>
<span style="color: #4f97d7;">{</span>
  id: <span style="color: #a45bad;">5</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
I could interpret the existence of a non-nil ID property as indicative of
the Package being at least Registered.
</p>

<p>
But I do not (not in the 1st stage). The only properties used in the first stage
in that EXACT order of a Package normalization function are:
</p>

<ul class="org-ul">
<li>targetState
The targetState is passed as an option to the normalization function.
If it has been defined it interrupts the function and returns immediately
operating under the assumption that the caller already knows what
the state of the target should be.</li>
<li>active
This property is found in a BackendForm package. If it is defined and true
it means the Package is currently active.</li>
<li>state
This property is found in an AfmForm package.</li>
<li>defaultState
The defaultState is passed as an option to the normalization function.
If no state has been deduced so far in the process, it is used.</li>
</ul>

<p>
The general pattern is that, the targetState has the highest precedence. It is
followed by State backendForm, then by afmForm State, then by defaultState.
</p>

<p>
In the tobject() functions which must also deduce state the order is:
targetState, afmForm, defaultState.
</p>

<p>
This is the end of the 1st stage.
</p>

<p>
The 2nd stage is responsible for binding the Content of the entity to its State.
</p>

<p>
What do I mean by that?.
</p>

<p>
Some properties such as:
</p>

<p>
state or active (in a Package)
</p>

<p>
are explicitly designed to convey state.
</p>

<p>
While the other properties in a Package are about its Contents.
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  id,
  t_started,
  t_ended,
  remainder,
  amount,
  ...
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
Therefore, one may allocate each Property as belonging to:
</p>

<ul class="org-ul">
<li>State</li>
<li>Content</li>
</ul>

<p>
So the 2st stage is about making sure that the target's Contents align with the
State from the 1st stage.
</p>

<p>
So again carrying on with the above Example:
</p>

<p>
A Package can be in one of four states:
</p>

<ul class="org-ul">
<li>Unregistered</li>
<li>Registered</li>
<li>Playing</li>
<li>Completed</li>
</ul>

<p>
(-START NOTE-)
I believe that the architecture of the backend should be based on Packages.
What do I mean?
Instead of having Teams with Packages and Teams having an active Package.
You have Packages with a 'has-a' Team.
So instead of (1)Team-(*)Packages you have a (1)Package-(1)Team.
But it is not, so I make best with what I have.
(-END NOTE-)
</p>


<p>
Lets say that the target after stage 1 looks like these:
</p>

<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  state: <span style="color: #2d9574;">'unregistered'</span>
  id: <span style="color: #a45bad;">5</span>,
  t_start: <span style="color: #a45bad;">100</span>,
  t_end: <span style="color: #a45bad;">500</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>

<p>
This is an example of a misalignment. The State says that this Package
is unregistered but the Contents say that it is Completed.
</p>

<p>
What should be done in this situation?
</p>

<p>
In order to help the developer know when a situation like this arises a
state Error is thrown.
</p>

<p>
So the 2nd stage is responsible for making sure that a misalignment never
occurs.
</p>
</div>
</div>
</div>
