docs/api.org
*** AFM Time
#+begin_src js
  {
    id: 3,
    name: 'Per Time 90',
    amount: 99999 // milliseconds
    type: "time",
    cost: 90.99,
    amount: 888, // milliseconds,
    remainder: 123, // milliseconds,
    t_start: 1232434324, // milliseconds,
    t_end: 1234234234, // milliseconds
    state: "unregistered" | "registered" | "playing" | "completed"
  }
#+end_src
*** AFM Missions
#+begin_src js
  {
    id: 3,
    name: 'Per Mission 5',
    amount: 5 // missions
    type: "mission",
    cost: 90.99,
    amount: 5, // missions
    remainder: 1, // missions,
    t_start: 1232434324, // milliseconds,
    t_end: 1234234234, // milliseconds
    state: "unregistered" | "registered" | "playing" | "completed"
  }
#+end_src
*** Backend Time
#+begin_src js
  // team's package
  {
    id: 5,
    name: 'Per Time 90',
    cost: null,
    started: 1706685129723, // milliseconds
    ended: null, // milliseconds
    duration: 5400, // seconds
    paused: false,
    active: true
  }
#+end_src
*** Backend Missions
#+begin_src js
  // team's package
  {
    id: 1,
    name: 'Per Mission 5',
    cost: null,
    started: null, // milliseconds
    ended: null, // milliseconds
    missions: 5, // missions
    missionsPlayed: 0, // missions
    active: false
  }
#+end_src
*** Available Backend packages
#+begin_src js
  // Missions
  {
    name: "Per Mission 5",
    amount: 5, // Missions
    type: "mission",
    cost: 150
  }

  // time
  {
    name: "Per Time 90",
    amount: 90, // minutes
    type: 'time',
    cost: 150
  }
#+end_src
** Device
*** AFM rpi reader
#+begin_src js
  {
    id: 'ADMINISTRATION1Reader',
    type: 'RPI_READER',
    room: 'ADMINISTRATION1'
  }
#+end_src
*** AFM admin screen
#+begin_src js
  {
    id: '001',
    type: 'REGISTRATION_SCREEN',
    room: 'ADMINISTRATION1'
  }
#+end_src
*** Backend
#+begin_src js
  {
    deviceId: '001',
    deviceType: 'REGISTRATION_SCREEN',
    roomType: 'ADMINISTRATION1'
  }
#+end_src
** Cashier
*** AFM
#+begin_src js
  {
    id: 4394,
    username: '80teepo7fu9',
    email: '80teepo7fu9@gmail.com',
    role: 'manager'
  }
#+end_src
** Player
