docs/api.html




<div id="outline-container-orgc8831e6" class="outline-2">
<h2 id="orgc8831e6"><span class="section-number-2">13.</span> Schemas</h2>
<div class="outline-text-2" id="text-13">
</div>
<div id="outline-container-org3f6d35d" class="outline-3">
<h3 id="org3f6d35d"><span class="section-number-3">13.1.</span> Package</h3>
<div class="outline-text-3" id="text-13-1">
</div>
<div id="outline-container-orgaefa1a9" class="outline-4">
<h4 id="orgaefa1a9"><span class="section-number-4">13.1.1.</span> AFM Time</h4>
<div class="outline-text-4" id="text-13-1-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  id: <span style="color: #a45bad;">3</span>,
  name: <span style="color: #2d9574;">'Per Time 90'</span>,
  amount: <span style="color: #a45bad;">99999</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">milliseconds</span>
  type: <span style="color: #2d9574;">"time"</span>,
  cost: <span style="color: #a45bad;">90</span>.<span style="color: #a45bad;">99</span>,
  amount: <span style="color: #a45bad;">888</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">milliseconds,</span>
  remainder: <span style="color: #a45bad;">123</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">milliseconds,</span>
  t_start: <span style="color: #a45bad;">1232434324</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">milliseconds,</span>
  t_end: <span style="color: #a45bad;">1234234234</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">milliseconds</span>
  state: <span style="color: #2d9574;">"unregistered"</span> | <span style="color: #2d9574;">"registered"</span> | <span style="color: #2d9574;">"playing"</span> | <span style="color: #2d9574;">"completed"</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb41b58b" class="outline-4">
<h4 id="orgb41b58b"><span class="section-number-4">13.1.2.</span> AFM Missions</h4>
<div class="outline-text-4" id="text-13-1-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  id: <span style="color: #a45bad;">3</span>,
  name: <span style="color: #2d9574;">'Per Mission 5'</span>,
  amount: <span style="color: #a45bad;">5</span> <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">missions</span>
  type: <span style="color: #2d9574;">"mission"</span>,
  cost: <span style="color: #a45bad;">90</span>.<span style="color: #a45bad;">99</span>,
  amount: <span style="color: #a45bad;">5</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">missions</span>
  remainder: <span style="color: #a45bad;">1</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">missions,</span>
  t_start: <span style="color: #a45bad;">1232434324</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">milliseconds,</span>
  t_end: <span style="color: #a45bad;">1234234234</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">milliseconds</span>
  state: <span style="color: #2d9574;">"unregistered"</span> | <span style="color: #2d9574;">"registered"</span> | <span style="color: #2d9574;">"playing"</span> | <span style="color: #2d9574;">"completed"</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org76eed2b" class="outline-4">
<h4 id="org76eed2b"><span class="section-number-4">13.1.3.</span> Backend Time</h4>
<div class="outline-text-4" id="text-13-1-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">team's package</span>
<span style="color: #4f97d7;">{</span>
  id: <span style="color: #a45bad;">5</span>,
  name: <span style="color: #2d9574;">'Per Time 90'</span>,
  cost: <span style="color: #a45bad;">null</span>,
  started: <span style="color: #a45bad;">1706685129723</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">milliseconds</span>
  ended: <span style="color: #a45bad;">null</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">milliseconds</span>
  duration: <span style="color: #a45bad;">5400</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">seconds</span>
  paused: <span style="color: #a45bad;">false</span>,
  active: <span style="color: #a45bad;">true</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org865619b" class="outline-4">
<h4 id="org865619b"><span class="section-number-4">13.1.4.</span> Backend Missions</h4>
<div class="outline-text-4" id="text-13-1-4">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">team's package</span>
<span style="color: #4f97d7;">{</span>
  id: <span style="color: #a45bad;">1</span>,
  name: <span style="color: #2d9574;">'Per Mission 5'</span>,
  cost: <span style="color: #a45bad;">null</span>,
  started: <span style="color: #a45bad;">null</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">milliseconds</span>
  ended: <span style="color: #a45bad;">null</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">milliseconds</span>
  missions: <span style="color: #a45bad;">5</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">missions</span>
  missionsPlayed: <span style="color: #a45bad;">0</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">missions</span>
  active: <span style="color: #a45bad;">false</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org2dca677" class="outline-4">
<h4 id="org2dca677"><span class="section-number-4">13.1.5.</span> Available Backend packages</h4>
<div class="outline-text-4" id="text-13-1-5">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Missions</span>
<span style="color: #4f97d7;">{</span>
  name: <span style="color: #2d9574;">"Per Mission 5"</span>,
  amount: <span style="color: #a45bad;">5</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">Missions</span>
  type: <span style="color: #2d9574;">"mission"</span>,
  cost: <span style="color: #a45bad;">150</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">time</span>
<span style="color: #4f97d7;">{</span>
  name: <span style="color: #2d9574;">"Per Time 90"</span>,
  amount: <span style="color: #a45bad;">90</span>, <span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">minutes</span>
  type: <span style="color: #2d9574;">'time'</span>,
  cost: <span style="color: #a45bad;">150</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd96f68f" class="outline-3">
<h3 id="orgd96f68f"><span class="section-number-3">13.2.</span> Device</h3>
<div class="outline-text-3" id="text-13-2">
</div>
<div id="outline-container-orgc387d02" class="outline-4">
<h4 id="orgc387d02"><span class="section-number-4">13.2.1.</span> AFM rpi reader</h4>
<div class="outline-text-4" id="text-13-2-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  id: <span style="color: #2d9574;">'ADMINISTRATION1Reader'</span>,
  type: <span style="color: #2d9574;">'RPI_READER'</span>,
  room: <span style="color: #2d9574;">'ADMINISTRATION1'</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org33e7c99" class="outline-4">
<h4 id="org33e7c99"><span class="section-number-4">13.2.2.</span> AFM admin screen</h4>
<div class="outline-text-4" id="text-13-2-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  id: <span style="color: #2d9574;">'001'</span>,
  type: <span style="color: #2d9574;">'REGISTRATION_SCREEN'</span>,
  room: <span style="color: #2d9574;">'ADMINISTRATION1'</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd3722b7" class="outline-4">
<h4 id="orgd3722b7"><span class="section-number-4">13.2.3.</span> Backend</h4>
<div class="outline-text-4" id="text-13-2-3">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  deviceId: <span style="color: #2d9574;">'001'</span>,
  deviceType: <span style="color: #2d9574;">'REGISTRATION_SCREEN'</span>,
  roomType: <span style="color: #2d9574;">'ADMINISTRATION1'</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4037363" class="outline-3">
<h3 id="org4037363"><span class="section-number-3">13.3.</span> Cashier</h3>
<div class="outline-text-3" id="text-13-3">
</div>
<div id="outline-container-org96a6d58" class="outline-4">
<h4 id="org96a6d58"><span class="section-number-4">13.3.1.</span> AFM</h4>
<div class="outline-text-4" id="text-13-3-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  id: <span style="color: #a45bad;">4394</span>,
  username: <span style="color: #2d9574;">'80teepo7fu9'</span>,
  email: <span style="color: #2d9574;">'80teepo7fu9@gmail.com'</span>,
  role: <span style="color: #2d9574;">'manager'</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
