docs/api.md


<a id="org5904f58"></a>

# Schemas


<a id="org607c806"></a>

## Package


<a id="org3b739dc"></a>

### AFM Time

    {
      id: 3,
      name: 'Per Time 90',
      amount: 99999 // milliseconds
      type: "time",
      cost: 90.99,
      amount: 888, // milliseconds,
      remainder: 123, // milliseconds,
      t_start: 1232434324, // milliseconds,
      t_end: 1234234234, // milliseconds
      state: "unregistered" | "registered" | "playing" | "completed"
    }


<a id="orgb9bb0d4"></a>

### AFM Missions

    {
      id: 3,
      name: 'Per Mission 5',
      amount: 5 // missions
      type: "mission",
      cost: 90.99,
      amount: 5, // missions
      remainder: 1, // missions,
      t_start: 1232434324, // milliseconds,
      t_end: 1234234234, // milliseconds
      state: "unregistered" | "registered" | "playing" | "completed"
    }


<a id="org31f422e"></a>

### Backend Time

    // team's package
    {
      id: 5,
      name: 'Per Time 90',
      cost: null,
      started: 1706685129723, // milliseconds
      ended: null, // milliseconds
      duration: 5400, // seconds
      paused: false,
      active: true
    }


<a id="org3c8bcab"></a>

### Backend Missions

    // team's package
    {
      id: 1,
      name: 'Per Mission 5',
      cost: null,
      started: null, // milliseconds
      ended: null, // milliseconds
      missions: 5, // missions
      missionsPlayed: 0, // missions
      active: false
    }


<a id="orgc2fb5f7"></a>

### Available Backend packages

    // Missions
    {
      name: "Per Mission 5",
      amount: 5, // Missions
      type: "mission",
      cost: 150
    }
    
    // time
    {
      name: "Per Time 90",
      amount: 90, // minutes
      type: 'time',
      cost: 150
    }


<a id="org14086e1"></a>

## Device


<a id="orgcca182b"></a>

### AFM rpi reader

    {
      id: 'ADMINISTRATION1Reader',
      type: 'RPI_READER',
      room: 'ADMINISTRATION1'
    }


<a id="org8ccb281"></a>

### AFM admin screen

    {
      id: '001',
      type: 'REGISTRATION_SCREEN',
      room: 'ADMINISTRATION1'
    }


<a id="orgfc0aac7"></a>

### Backend

    {
      deviceId: '001',
      deviceType: 'REGISTRATION_SCREEN',
      roomType: 'ADMINISTRATION1'
    }


<a id="org111176c"></a>

## Cashier


<a id="org568f849"></a>

### AFM

    {
      id: 4394,
      username: '80teepo7fu9',
      email: '80teepo7fu9@gmail.com',
      role: 'manager'
    }
