docs/api.org
*** AFM
#+begin_src js
  {
    username: "test"
    name: "testname",
    surname: "testsurname",
    email: "test@gmail.com",
    state: 'unregistered' || 'registered' || 'inTeam' || 'playing'
    wristband: {
      id: null || 3,
      color: null || 'green',
      colorCode: null || 3,
      state: "unpaired" || "pairing" || "unpairing" || "paired"
    }
  }
#+end_src
*** Backend
#+begin_src js
  {
    username: "test",
    name: "test",
    surname: "test",
    email: "test@gmail.com",
    wristbandMerged: true || false,
  }
#+end_src
** Team
** Wristband
*** AFM
#+begin_src js
  {
    id: 3,
    color: "green",
    colorCode: 2,
    state: "unpaired" || "pairing" || "unpairing" || "paired"
  }
#+end_src
*** Backend
#+begin_src js

  // wristband register
  {
    timestamp : 1706957679789,
    username : "diwgp3nrrtf",
    wristbandNumber : 234
  }

  // wristband deregister
  {
    timestamp : 1706960913123,
    result : "OK",
    message : "successfully unregisterWristbandToPlayer"
  }

  // wristband info
  {
    timestamp: 1706879364557,
    result: 'OK',
    wristband: { wristbandNumber: 3, wristbandColor: 2, active: false }
  }

  // wristband scan
  {
    timestamp: 1706880614077,
    result: 'OK',
    wristbandNumber: 3,
    wristbandColor: 3
  }


  // list registered players + search players
  {
    username: 'Merry_2mpmnxcgv1s',
    name: 'Merry',
    surname: 'compassionate',
    email: 'Merry@gmail.com',
    wristbandMerged: false,
    wristband: null
  },
  {
    username: 'Wormtongue_klagnkjxqla',
    name: 'Wormtongue',
    surname: 'jovial',
    email: 'Wormtongue@gmail.com',
    wristbandMerged: false,
    wristband: { wristbandNumber: 230, wristbandColor: 3, active: true }
  },

  // list registered players with writband
  {
    username: 'Gandalf_deil7sv8j4c',
    name: 'Gandalf',
    surname: 'busy',
    email: 'Gandalf@gmail.com',
    wristbandMerged: false,
    wristband: { wristbandNumber: 233, wristbandColor: 4, active: true }
  },

  // list teams
  players: [
    {
      username: 'test1',
      wristbandNumber: null,
      wristbandColor: null
    },
    {
      username: "test3",
      wristbandNumber: 1,
      wristbandColor: null,
    },
    {
      username: "test4",
      wristbandNumber: null,
      wristbandColor: 2,
    },

    {
      username: "Sauron_0h96h9q4xixv",
      wristbandNumber: 241,
      wristbandColor: 2,
    },

  ]
#+end_src

