docs/api.html
<div id="outline-container-orge0a8a15" class="outline-3">
<h3 id="orge0a8a15"><span class="section-number-3">13.4.</span> Player</h3>
<div class="outline-text-3" id="text-13-4">
</div>
<div id="outline-container-orgeb3be3f" class="outline-4">
<h4 id="orgeb3be3f"><span class="section-number-4">13.4.1.</span> AFM</h4>
<div class="outline-text-4" id="text-13-4-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  username: <span style="color: #2d9574;">"test"</span>
  name: <span style="color: #2d9574;">"testname"</span>,
  surname: <span style="color: #2d9574;">"testsurname"</span>,
  email: <span style="color: #2d9574;">"test@gmail.com"</span>,
  state: <span style="color: #2d9574;">'unregistered'</span> || <span style="color: #2d9574;">'registered'</span> || <span style="color: #2d9574;">'inTeam'</span> || <span style="color: #2d9574;">'playing'</span>
  wristband: <span style="color: #bc6ec5;">{</span>
    id: <span style="color: #a45bad;">null</span> || <span style="color: #a45bad;">3</span>,
    color: <span style="color: #a45bad;">null</span> || <span style="color: #2d9574;">'green'</span>,
    colorCode: <span style="color: #a45bad;">null</span> || <span style="color: #a45bad;">3</span>,
    state: <span style="color: #2d9574;">"unpaired"</span> || <span style="color: #2d9574;">"pairing"</span> || <span style="color: #2d9574;">"unpairing"</span> || <span style="color: #2d9574;">"paired"</span>
  <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf900f7c" class="outline-4">
<h4 id="orgf900f7c"><span class="section-number-4">13.4.2.</span> Backend</h4>
<div class="outline-text-4" id="text-13-4-2">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  username: <span style="color: #2d9574;">"test"</span>,
  name: <span style="color: #2d9574;">"test"</span>,
  surname: <span style="color: #2d9574;">"test"</span>,
  email: <span style="color: #2d9574;">"test@gmail.com"</span>,
  wristbandMerged: <span style="color: #a45bad;">true</span> || <span style="color: #a45bad;">false</span>,
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org8affc75" class="outline-3">
<h3 id="org8affc75"><span class="section-number-3">13.5.</span> Team</h3>
</div>
<div id="outline-container-org265e2ce" class="outline-3">
<h3 id="org265e2ce"><span class="section-number-3">13.6.</span> Wristband</h3>
<div class="outline-text-3" id="text-13-6">
</div>
<div id="outline-container-org3e9c380" class="outline-4">
<h4 id="org3e9c380"><span class="section-number-4">13.6.1.</span> AFM</h4>
<div class="outline-text-4" id="text-13-6-1">
<div class="org-src-container">
<pre class="src src-js"><span style="color: #4f97d7;">{</span>
  id: <span style="color: #a45bad;">3</span>,
  color: <span style="color: #2d9574;">"green"</span>,
  colorCode: <span style="color: #a45bad;">2</span>,
  state: <span style="color: #2d9574;">"unpaired"</span> || <span style="color: #2d9574;">"pairing"</span> || <span style="color: #2d9574;">"unpairing"</span> || <span style="color: #2d9574;">"paired"</span>
<span style="color: #4f97d7;">}</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org50bfd99" class="outline-4">
<h4 id="org50bfd99"><span class="section-number-4">13.6.2.</span> Backend</h4>
<div class="outline-text-4" id="text-13-6-2">
<div class="org-src-container">
<pre class="src src-js">
<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">wristband register</span>
<span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1706957679789</span>,
  username : <span style="color: #2d9574;">"diwgp3nrrtf"</span>,
  wristbandNumber : <span style="color: #a45bad;">234</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">wristband deregister</span>
<span style="color: #4f97d7;">{</span>
  timestamp : <span style="color: #a45bad;">1706960913123</span>,
  result : <span style="color: #2d9574;">"OK"</span>,
  message : <span style="color: #2d9574;">"successfully unregisterWristbandToPlayer"</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">wristband info</span>
<span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706879364557</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  wristband: <span style="color: #bc6ec5;">{</span> wristbandNumber: <span style="color: #a45bad;">3</span>, wristbandColor: <span style="color: #a45bad;">2</span>, active: <span style="color: #a45bad;">false</span> <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">wristband scan</span>
<span style="color: #4f97d7;">{</span>
  timestamp: <span style="color: #a45bad;">1706880614077</span>,
  result: <span style="color: #2d9574;">'OK'</span>,
  wristbandNumber: <span style="color: #a45bad;">3</span>,
  wristbandColor: <span style="color: #a45bad;">3</span>
<span style="color: #4f97d7;">}</span>


<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">list registered players + search players</span>
<span style="color: #4f97d7;">{</span>
  username: <span style="color: #2d9574;">'Merry_2mpmnxcgv1s'</span>,
  name: <span style="color: #2d9574;">'Merry'</span>,
  surname: <span style="color: #2d9574;">'compassionate'</span>,
  email: <span style="color: #2d9574;">'Merry@gmail.com'</span>,
  wristbandMerged: <span style="color: #a45bad;">false</span>,
  wristband: <span style="color: #a45bad;">null</span>
<span style="color: #4f97d7;">}</span>,
<span style="color: #4f97d7;">{</span>
  username: <span style="color: #2d9574;">'Wormtongue_klagnkjxqla'</span>,
  name: <span style="color: #2d9574;">'Wormtongue'</span>,
  surname: <span style="color: #2d9574;">'jovial'</span>,
  email: <span style="color: #2d9574;">'Wormtongue@gmail.com'</span>,
  wristbandMerged: <span style="color: #a45bad;">false</span>,
  wristband: <span style="color: #bc6ec5;">{</span> wristbandNumber: <span style="color: #a45bad;">230</span>, wristbandColor: <span style="color: #a45bad;">3</span>, active: <span style="color: #a45bad;">true</span> <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>,

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">list registered players with writband</span>
<span style="color: #4f97d7;">{</span>
  username: <span style="color: #2d9574;">'Gandalf_deil7sv8j4c'</span>,
  name: <span style="color: #2d9574;">'Gandalf'</span>,
  surname: <span style="color: #2d9574;">'busy'</span>,
  email: <span style="color: #2d9574;">'Gandalf@gmail.com'</span>,
  wristbandMerged: <span style="color: #a45bad;">false</span>,
  wristband: <span style="color: #bc6ec5;">{</span> wristbandNumber: <span style="color: #a45bad;">233</span>, wristbandColor: <span style="color: #a45bad;">4</span>, active: <span style="color: #a45bad;">true</span> <span style="color: #bc6ec5;">}</span>
<span style="color: #4f97d7;">}</span>,

<span style="color: #2aa1ae; background-color: #292e34;">// </span><span style="color: #2aa1ae; background-color: #292e34;">list teams</span>
players: <span style="color: #4f97d7;">[</span>
  <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">'test1'</span>,
    wristbandNumber: <span style="color: #a45bad;">null</span>,
    wristbandColor: <span style="color: #a45bad;">null</span>
  <span style="color: #bc6ec5;">}</span>,
  <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">"test3"</span>,
    wristbandNumber: <span style="color: #a45bad;">1</span>,
    wristbandColor: <span style="color: #a45bad;">null</span>,
  <span style="color: #bc6ec5;">}</span>,
  <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">"test4"</span>,
    wristbandNumber: <span style="color: #a45bad;">null</span>,
    wristbandColor: <span style="color: #a45bad;">2</span>,
  <span style="color: #bc6ec5;">}</span>,

  <span style="color: #bc6ec5;">{</span>
    username: <span style="color: #2d9574;">"Sauron_0h96h9q4xixv"</span>,
    wristbandNumber: <span style="color: #a45bad;">241</span>,
    wristbandColor: <span style="color: #a45bad;">2</span>,
  <span style="color: #bc6ec5;">}</span>,

<span style="color: #4f97d7;">]</span>
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2024-03-01 Fri 01:26</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>